#pragma once

// RogueCompany (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum Killstreak.EItemSourceType
enum class EItemSourceType : uint8_t
{
	Unknown                        = 0,
	AbilityUse                     = 1,
	Cheat                          = 2,
	InitialInventory               = 3,
	LobbyAnimation                 = 4,
	PickupInteraction              = 5,
	Refund                         = 6,
	RestoreInventory               = 7,
	StorePurchase                  = 8,
	WeaponSwap                     = 9,
	EItemSourceType_MAX            = 10
};


// Enum Killstreak.EKSCharacterAimMode
enum class EKSCharacterAimMode : uint8_t
{
	Default                        = 0,
	TransitionToDefault            = 1,
	Shoulder                       = 2,
	TransitionToShoulder           = 3,
	AimDownSights                  = 4,
	TransitionToAimDownSights      = 5,
	Alternate                      = 6,
	TransitionToAlternate          = 7,
	EKSCharacterAimMode_MAX        = 8
};


// Enum Killstreak.EKSEmotion
enum class EKSEmotion : uint8_t
{
	Neutral                        = 0,
	Focused                        = 1,
	Pain                           = 2,
	Wounded                        = 3,
	Dead                           = 4,
	MAX                            = 5
};


// Enum Killstreak.EAmmoType
enum class EAmmoType : uint8_t
{
	NINE_MM                        = 0,
	SEVEN                          = 1,
	FIVE                           = 2,
	TWELVE_G                       = 3,
	FORTY_FIVE                     = 4,
	THREE_HUND                     = 5,
	TWENTY_TWO                     = 6,
	FIFTY                          = 7,
	NONE                           = 8,
	EAmmoType_MAX                  = 9
};


// Enum Killstreak.ECharacterBehaviorState
enum class ECharacterBehaviorState : uint8_t
{
	Combat                         = 0,
	Idle                           = 1,
	Skydive                        = 2,
	ECharacterBehaviorState_MAX    = 3
};


// Enum Killstreak.EKSItemUsageFailureType
enum class EKSItemUsageFailureType : uint8_t
{
	Unknown                        = 0,
	NotEnoughQuantity              = 1,
	BlockingAction                 = 2,
	NoEffect                       = 3,
	EMP                            = 4,
	EKSItemUsageFailureType_MAX    = 5
};


// Enum Killstreak.EShotgunHitResult
enum class EShotgunHitResult : uint8_t
{
	Miss                           = 0,
	Hit                            = 1,
	Headshot                       = 2,
	EShotgunHitResult_MAX          = 3
};


// Enum Killstreak.ELootSiteRarity
enum class ELootSiteRarity : uint8_t
{
	Personal                       = 0,
	Normal                         = 1,
	Uncommon                       = 2,
	Epic                           = 3,
	Rare                           = 4,
	Legendary                      = 5,
	NonWeapons                     = 6,
	ChildSpawner                   = 7,
	CarePackage                    = 8,
	MedPack                        = 9,
	StartingDrop                   = 10,
	GameMode                       = 11,
	ELootSiteRarity_MAX            = 12
};


// Enum Killstreak.ECombatEventFriendlyFireType
enum class ECombatEventFriendlyFireType : uint8_t
{
	Enemy                          = 0,
	Friendly                       = 1,
	ReverseFriendly                = 2,
	Self                           = 3,
	ECombatEventFriendlyFireType_MAX = 4
};


// Enum Killstreak.ECombatEventRepType
enum class ECombatEventRepType : uint8_t
{
	Basic                          = 0,
	AdvancedStart                  = 1,
	AdvancedEnd                    = 2,
	ECombatEventRepType_MAX        = 3
};


// Enum Killstreak.EProjectileExplosionType
enum class EProjectileExplosionType : uint8_t
{
	Impact                         = 0,
	Fizzle                         = 1,
	FuseExpired                    = 2,
	EProjectileExplosionType_MAX   = 3
};


// Enum Killstreak.EHitLocationType
enum class EHitLocationType : uint8_t
{
	Body                           = 0,
	Head                           = 1,
	Limb                           = 2,
	None                           = 3,
	EHitLocationType_MAX           = 4
};


// Enum Killstreak.EKSVoicelineAudience
enum class EKSVoicelineAudience : uint8_t
{
	Self                           = 0,
	Nearby                         = 1,
	NearbyFriendlies               = 2,
	AllFriendlies                  = 3,
	Enemies                        = 4,
	EKSVoicelineAudience_MAX       = 5
};


// Enum Killstreak.EAccoladeEventType
enum class EAccoladeEventType : uint8_t
{
	AccoladeEvent_Unknown          = 0,
	AccoladeEvent_Elim             = 1,
	AccoladeEvent_Downed           = 2,
	AccoladeEvent_Revived          = 3,
	AccoladeEvent_DownAssist       = 4,
	AccoladeEvent_CombatEvent      = 5,
	AccoladeEvent_MAX              = 6
};


// Enum Killstreak.EAccoladeCategory
enum class EAccoladeCategory : uint8_t
{
	AccoladeCategory_DownsElims    = 0,
	AccoladeCategory_MultiKill     = 1,
	AccoladeCategory_Support       = 2,
	AccoladeCategory_MAX           = 3
};


// Enum Killstreak.EDisplayType
enum class EDisplayType : uint8_t
{
	Mini                           = 0,
	Full                           = 1,
	Overlay                        = 2,
	EDisplayType_MAX               = 3
};


// Enum Killstreak.EPingFailedType
enum class EPingFailedType : uint8_t
{
	None                           = 0,
	Throttled                      = 1,
	NoTarget                       = 2,
	InvalidPingType                = 3,
	EPingFailedType_MAX            = 4
};


// Enum Killstreak.EPingType
enum class EPingType : uint8_t
{
	None                           = 0,
	Waypoint                       = 1,
	EnemySpotted                   = 2,
	Caution                        = 3,
	Item                           = 4,
	Objective                      = 5,
	Task                           = 6,
	EPingType_MAX                  = 7
};


// Enum Killstreak.ESplineBehaviourType
enum class ESplineBehaviourType : uint8_t
{
	OneShot                        = 0,
	OneShot_Reverse                = 1,
	Loop_Reset                     = 2,
	PingPong                       = 3,
	ESplineBehaviourType_MAX       = 4
};


// Enum Killstreak.EShopItemType
enum class EShopItemType : uint8_t
{
	None                           = 0,
	PrimaryOne                     = 1,
	PrimaryTwo                     = 2,
	SecondaryOne                   = 3,
	SecondaryTwo                   = 4,
	GadgetOne                      = 5,
	GadgetTwo                      = 6,
	Melee                          = 7,
	PerkOne                        = 8,
	PerkTwo                        = 9,
	PerkThree                      = 10,
	PerkFour                       = 11,
	PerkFive                       = 12,
	PerkSix                        = 13,
	GambitOne                      = 14,
	GambitTwo                      = 15,
	GambitThree                    = 16,
	GlobalPerk1                    = 17,
	GlobalPerk2                    = 18,
	GlobalPerk3                    = 19,
	GlobalPerk4                    = 20,
	GlobalPerk5                    = 21,
	GlobalPerk6                    = 22,
	GlobalPerk7                    = 23,
	GlobalPerk8                    = 24,
	GlobalPerk9                    = 25,
	GlobalPerk10                   = 26,
	GlobalPerk11                   = 27,
	GlobalPerk12                   = 28,
	GlobalPerk13                   = 29,
	GlobalPerk14                   = 30,
	GlobalPerk15                   = 31,
	MAX                            = 32
};


// Enum Killstreak.ETrackedActorType
enum class ETrackedActorType : uint8_t
{
	Unknown                        = 0,
	ShieldWeapon                   = 1,
	MagGloveTarget                 = 2,
	CoopEscapePoint                = 3,
	BountyTarget                   = 4,
	BombDrop                       = 5,
	CashDrop                       = 6,
	Projectile                     = 7,
	HackTablet                     = 8,
	ETrackedActorType_MAX          = 9
};


// Enum Killstreak.EKSNeutralBombState
enum class EKSNeutralBombState : uint8_t
{
	Spawned                        = 0,
	Reset                          = 1,
	Held                           = 2,
	Dropped                        = 3,
	Arming                         = 4,
	Armed                          = 5,
	Disarming                      = 6,
	Disarmed                       = 7,
	EKSNeutralBombState_MAX        = 8
};


// Enum Killstreak.EJobSelectionState
enum class EJobSelectionState : uint8_t
{
	Available                      = 0,
	Selected                       = 1,
	LockedIn                       = 2,
	EJobSelectionState_MAX         = 3
};


// Enum Killstreak.EKSJobSelectPreviewLoadState
enum class EKSJobSelectPreviewLoadState : uint8_t
{
	NoPreview                      = 0,
	PreviewActive                  = 1,
	PreviewLoadingNoVisible        = 2,
	PreviewLoadingActiveVisible    = 3,
	EKSJobSelectPreviewLoadState_MAX = 4
};


// Enum Killstreak.ETeamAlignment
enum class ETeamAlignment : uint8_t
{
	TMAL_Neutral                   = 0,
	TMAL_Enemy                     = 1,
	TMAL_Friendly                  = 2,
	TMAL_MAX                       = 3
};


// Enum Killstreak.EAnnouncementType
enum class EAnnouncementType : uint8_t
{
	ANMT_Uknown                    = 0,
	ANMT_ObjectiveMilestone        = 1,
	ANMT_PlayersLeft               = 2,
	ANMT_LastPlayerStanding        = 3,
	ANMT_RoyalePhase               = 4,
	ANMT_MAX                       = 5
};


// Enum Killstreak.EGameResult
enum class EGameResult : uint8_t
{
	Victory                        = 0,
	Defeat                         = 1,
	Draw                           = 2,
	EGameResult_MAX                = 3
};


// Enum Killstreak.EKSInteractionResult
enum class EKSInteractionResult : uint8_t
{
	None                           = 0,
	Success                        = 1,
	Interrupted                    = 2,
	Failed                         = 3,
	EKSInteractionResult_MAX       = 4
};


// Enum Killstreak.EKSAbilityUsageFailureType
enum class EKSAbilityUsageFailureType : uint8_t
{
	Unknown                        = 0,
	Dead                           = 1,
	Downed                         = 2,
	EMP                            = 3,
	NoFireZone                     = 4,
	AlreadyActivating              = 5,
	Driving                        = 6,
	Stunned                        = 7,
	BlockingMovement               = 8,
	HardLanding                    = 9,
	OutOfBounds                    = 10,
	Locked                         = 11,
	AltLocked                      = 12,
	NotEnoughCharge                = 13,
	NoBountyTarget                 = 14,
	AlreadyHasWeapon               = 15,
	WeaponBusy                     = 16,
	RoundNotInProgress             = 17,
	EKSAbilityUsageFailureType_MAX = 18
};


// Enum Killstreak.EWeaponStateNew
enum class EWeaponStateNew : uint8_t
{
	Idle                           = 0,
	Buildup                        = 1,
	PreFire                        = 2,
	PostFire                       = 3,
	Cooldown                       = 4,
	PreReload                      = 5,
	PostReload                     = 6,
	ReloadCooldown                 = 7,
	Retrieve                       = 8,
	Holster                        = 9,
	Inactive                       = 10,
	EWeaponStateNew_MAX            = 11
};


// Enum Killstreak.EKSPingType
enum class EKSPingType : uint8_t
{
	PING_DEFAULT                   = 0,
	PING_RADAR                     = 1,
	PING_INTEL                     = 2,
	PING_TRACKER                   = 3,
	PING_BOMB_HOLDER               = 4,
	PING_MAX                       = 5
};


// Enum Killstreak.ESurfaceTargetErrorReason
enum class ESurfaceTargetErrorReason : uint8_t
{
	None                           = 0,
	TooFar                         = 1,
	TooHigh                        = 2,
	NoRoomAtOrigin                 = 3,
	InvalidSurface                 = 4,
	TooClose                       = 5,
	AimBlocked                     = 6,
	ESurfaceTargetErrorReason_MAX  = 7
};


// Enum Killstreak.EAimDataMode
enum class EAimDataMode : uint8_t
{
	NoEndTrace                     = 0,
	EndTraceFromStartTrace         = 1,
	EndTraceFromViewPoint          = 2,
	Shotgun                        = 3,
	EAimDataMode_MAX               = 4
};


// Enum Killstreak.EKSActivityProgressDisplayType
enum class EKSActivityProgressDisplayType : uint8_t
{
	Default                        = 0,
	RawProgress                    = 1,
	PercentToNextTier              = 2,
	PercentToMaxTier               = 3,
	MinutesAsDuration              = 4,
	CurrentTier                    = 5,
	None                           = 6,
	EKSActivityProgressDisplayType_MAX = 7
};


// Enum Killstreak.EKSActivityTimeQueryType
enum class EKSActivityTimeQueryType : uint8_t
{
	All                            = 0,
	OnlyFinished                   = 1,
	OnlyUnfinished                 = 2,
	EKSActivityTimeQueryType_MAX   = 3
};


// Enum Killstreak.EKSActivityManagerSetupPhase
enum class EKSActivityManagerSetupPhase : uint8_t
{
	None                           = 0,
	InitialAssetScan               = 1,
	RequestAchievements            = 2,
	RequestStoreVendors            = 3,
	RequestXpTables                = 4,
	LoadActivities                 = 5,
	WaitForSelectionPhaseFinished  = 6,
	AttemptInitialActivityCreation = 7,
	Done                           = 8,
	EKSActivityManagerSetupPhase_MAX = 9
};


// Enum Killstreak.EKSActivityInstanceQueryType
enum class EKSActivityInstanceQueryType : uint8_t
{
	LowestProgress                 = 0,
	HighestProgress                = 1,
	LowestTier                     = 2,
	HighestTier                    = 3,
	EKSActivityInstanceQueryType_MAX = 4
};


// Enum Killstreak.EReviveDroneFlightPath
enum class EReviveDroneFlightPath : uint8_t
{
	Drop                           = 0,
	Left                           = 1,
	Right                          = 2,
	EReviveDroneFlightPath_MAX     = 3
};


// Enum Killstreak.EReviveDroneState
enum class EReviveDroneState : uint8_t
{
	Release                        = 0,
	Transit                        = 1,
	Arrival                        = 2,
	Hover                          = 3,
	Leave                          = 4,
	EReviveDroneState_MAX          = 5
};


// Enum Killstreak.EAgentRefundMethod
enum class EAgentRefundMethod : uint8_t
{
	GiveWeaponAsset                = 0,
	BroadcastDelegate              = 1,
	EAgentRefundMethod_MAX         = 2
};


// Enum Killstreak.EKSAimAssistInputFlag
enum class EKSAimAssistInputFlag : uint8_t
{
	GamepadOnly                    = 0,
	GamepadAndTouch                = 1,
	AllInputModes                  = 2,
	EKSAimAssistInputFlag_MAX      = 3
};


// Enum Killstreak.EKSAimAssistActivationType
enum class EKSAimAssistActivationType : uint8_t
{
	AIMASSIST_DEFAULT              = 0,
	AIMASSIST_ALWAYSON             = 1,
	AIMASSIST_ALWAYSOFF            = 2,
	AIMASSIST_MAX                  = 3
};


// Enum Killstreak.EKSAnalogStickType
enum class EKSAnalogStickType : uint8_t
{
	Unknown                        = 0,
	Left                           = 1,
	Right                          = 2,
	EKSAnalogStickType_MAX         = 3
};


// Enum Killstreak.EActorFocalPoint
enum class EActorFocalPoint : uint8_t
{
	ActorFocalPoint_None           = 0,
	ActorFocalPoint_Head           = 1,
	ActorFocalPoint_Body           = 2,
	ActorFocalPoint_LeftShoulder   = 3,
	ActorFocalPoint_RightShoulder  = 4,
	ActorFocalPoint_MAX            = 5
};


// Enum Killstreak.EKSArmVisibilityType
enum class EKSArmVisibilityType : uint8_t
{
	HideNothing                    = 0,
	ArmAndWeapon                   = 1,
	WeaponOnly                     = 2,
	EKSArmVisibilityType_MAX       = 3
};


// Enum Killstreak.EKSRevealType
enum class EKSRevealType : uint8_t
{
	NotRevealed                    = 0,
	Normal                         = 1,
	Permanent                      = 2,
	EKSRevealType_MAX              = 3
};


// Enum Killstreak.EKSPlayerHand
enum class EKSPlayerHand : uint8_t
{
	LeftHand                       = 0,
	RightHand                      = 1,
	EKSPlayerHand_MAX              = 2
};


// Enum Killstreak.EKSMaterialHideType
enum class EKSMaterialHideType : uint8_t
{
	CastsShadowWhenHidden          = 0,
	DoesNotCastShadowWhenHidden    = 1,
	EKSMaterialHideType_MAX        = 2
};


// Enum Killstreak.EKSVehicleState
enum class EKSVehicleState : uint8_t
{
	Outside                        = 0,
	Entering                       = 1,
	Driver                         = 2,
	Passenger                      = 3,
	Exiting                        = 4,
	EKSVehicleState_MAX            = 5
};


// Enum Killstreak.EAimDownSightsMode
enum class EAimDownSightsMode : uint8_t
{
	Toggle                         = 0,
	PressAndHold                   = 1,
	EAimDownSightsMode_MAX         = 2
};


// Enum Killstreak.EKSQualitySwitch
enum class EKSQualitySwitch : uint8_t
{
	LocomotionCached               = 0,
	SecondLocomotionCached         = 1,
	PreAimArray                    = 2,
	PostWingSuit                   = 3,
	Finalized3p                    = 4,
	PreFacialAnimation             = 5,
	PostFacialAnimation            = 6,
	PrePowSlide_SklController      = 7,
	PreHitReactions                = 8,
	PostFootIK                     = 9,
	PostZiplinePullyLocks          = 10,
	PostZiplineSkeletalControllers = 11,
	PreRecoil                      = 12,
	PostRecoil                     = 13,
	PreCounterRotate               = 14,
	SkeletalControllersPostIK      = 15,
	PreVaulting_SKLController      = 16,
	PostVaulting_SKLController     = 17,
	EKSQualitySwitch_MAX           = 18
};


// Enum Killstreak.EKSTurnInPlaceAnimationVariant
enum class EKSTurnInPlaceAnimationVariant : uint8_t
{
	Left90                         = 0,
	Left180                        = 1,
	Right90                        = 2,
	Right180                       = 3,
	EKSTurnInPlaceAnimationVariant_MAX = 4
};


// Enum Killstreak.EKSLocomotionState
enum class EKSLocomotionState : uint8_t
{
	Idle                           = 0,
	InMotion                       = 1,
	Stopping                       = 2,
	Pivoting                       = 3,
	EKSLocomotionState_MAX         = 4
};


// Enum Killstreak.EKSQueuedMovement
enum class EKSQueuedMovement : uint8_t
{
	Jump                           = 0,
	DodgeRoll                      = 1,
	None                           = 2,
	EKSQueuedMovement_MAX          = 3
};


// Enum Killstreak.EKSDeathState
enum class EKSDeathState : uint8_t
{
	NotDead                        = 0,
	NormalDeath                    = 1,
	EKSDeathState_MAX              = 2
};


// Enum Killstreak.EFlashBangIntensity
enum class EFlashBangIntensity : uint8_t
{
	Min                            = 0,
	Half                           = 1,
	Max                            = 2
};


// Enum Killstreak.EInterruptNotifyBehaviorType
enum class EInterruptNotifyBehaviorType : uint8_t
{
	NoNotify                       = 0,
	OnlyIfMarkedPlaying            = 1,
	EInterruptNotifyBehaviorType_MAX = 2
};


// Enum Killstreak.EKSEmoteInterruptReason
enum class EKSEmoteInterruptReason : uint8_t
{
	Unknown                        = 0,
	NoCharacter                    = 1,
	Walking                        = 2,
	Sprinting                      = 3,
	Downed                         = 4,
	Dead                           = 5,
	Interacting                    = 6,
	Zipline                        = 7,
	SkyDiving                      = 8,
	DodgeRolling                   = 9,
	Falling                        = 10,
	NonEmoteEquipment              = 11,
	EmoteActivated                 = 12,
	EmoteCooldown                  = 13,
	InvalidTargeting               = 14,
	EKSEmoteInterruptReason_MAX    = 15
};


// Enum Killstreak.EKSLootRespawnMode
enum class EKSLootRespawnMode : uint8_t
{
	RespawnActiveSites             = 0,
	RespawnRandomSites             = 1,
	EKSLootRespawnMode_MAX         = 2
};


// Enum Killstreak.EKSRewardType
enum class EKSRewardType : uint8_t
{
	MatchInProgress                = 0,
	Winner                         = 1,
	Loser                          = 2,
	Draw                           = 3,
	EKSRewardType_MAX              = 4
};


// Enum Killstreak.EPlayerInfoInventoryRestoreType
enum class EPlayerInfoInventoryRestoreType : uint8_t
{
	ResetToStartingInventory       = 0,
	KeepInventory                  = 1,
	KeepInventoryIfNotDead         = 2,
	KeepGunsOnly                   = 3,
	UseNewMethod                   = 4,
	EPlayerInfoInventoryRestoreType_MAX = 5
};


// Enum Killstreak.EKillCamStatus
enum class EKillCamStatus : uint8_t
{
	KillCamEnabled                 = 0,
	KillCamDisabled                = 1,
	EKillCamStatus_MAX             = 2
};


// Enum Killstreak.EKSGamepadIcons
enum class EKSGamepadIcons : uint8_t
{
	XboxOne                        = 0,
	PlayStation4                   = 1,
	NintendoSwitch                 = 2,
	EKSGamepadIcons_MAX            = 3
};


// Enum Killstreak.EGyroMode
enum class EGyroMode : uint8_t
{
	None                           = 0,
	AimOnly                        = 1,
	Always                         = 2,
	EGyroMode_MAX                  = 3
};


// Enum Killstreak.EADSMode
enum class EADSMode : uint8_t
{
	Hold                           = 0,
	Toggle                         = 1,
	Both                           = 2,
	EADSMode_MAX                   = 3
};


// Enum Killstreak.EInMatchStoreError
enum class EInMatchStoreError : uint8_t
{
	NotEnoughMoney                 = 0,
	NullItem                       = 1,
	DeadCharacter                  = 2,
	InvalidPlayer                  = 3,
	BuyingSameItem                 = 4,
	CantEquip                      = 5,
	BadSlot                        = 6,
	EquipFailed                    = 7,
	InvalidGameMode                = 8,
	PurchasesLocked                = 9,
	ItemDidNotReplicate            = 10,
	EInMatchStoreError_MAX         = 11
};


// Enum Killstreak.EKSLabelAndHighlightState
enum class EKSLabelAndHighlightState : uint8_t
{
	NotTargeted                    = 0,
	Targeted                       = 1,
	EKSLabelAndHighlightState_MAX  = 2
};


// Enum Killstreak.EJobLoadoutSlot
enum class EJobLoadoutSlot : uint8_t
{
	JobSlot_Unknown                = 0,
	JobSlot_JobItem                = 1,
	JobSlot_UniqueItem             = 2,
	JobSlot_PrimaryWeapon          = 3,
	JobSlot_PrimaryWeaponAttachment = 4,
	JobSlot_SecondaryWeapon        = 5,
	JobSlot_SecondaryWeaponAttachment = 6,
	JobSlot_Gadget                 = 7,
	JobSlot_PerkOne                = 8,
	JobSlot_PerkTwo                = 9,
	JobSlot_PrimaryWeapon_Alt      = 10,
	JobSlot_SecondaryWeapon_Alt    = 11,
	JobSlot_Gadget_Alt             = 12,
	JobSlot_Melee                  = 13,
	JobSlot_QuickMelee             = 14,
	JobSlot_MAX                    = 15
};


// Enum Killstreak.EMercCosmeticSlot
enum class EMercCosmeticSlot : uint8_t
{
	EMOTE_SLOT                     = 0,
	SKIN_BUNDLE_SLOT               = 1,
	WEAPON_WRAP_SLOT               = 2,
	EMercCosmeticSlot_MAX          = 3
};


// Enum Killstreak.ELobbyCharacterIndex
enum class ELobbyCharacterIndex : uint8_t
{
	LobbyCharacter_Unknown         = 0,
	LobbyCharacter_LocalPlayer     = 1,
	LobbyCharacter_PartyMemberOne  = 2,
	LobbyCharacter_PartyMemberTwo  = 3,
	LobbyCharacter_PartyMemberThree = 4,
	LobbyCharacter_RogueScreen     = 5,
	LobbyCharacter_MAX             = 6
};


// Enum Killstreak.ELobbyCharacterAnimState
enum class ELobbyCharacterAnimState : uint8_t
{
	LobbyAnim_Unknown              = 0,
	LobbyAnim_Login                = 1,
	LobbyAnim_Default              = 2,
	LobbyAnim_Hidden               = 3,
	LobbyAnim_Idle                 = 4,
	LobbyAnim_IntroWalk            = 5,
	LobbyAnim_EmoteOne             = 6,
	LobbyAnim_EmoteTwo             = 7,
	LobbyAnim_EmoteThree           = 8,
	LobbyAnim_EmoteFour            = 9,
	LobbyAnim_EmoteFive            = 10,
	LobbyAnim_PreMatchWalk         = 11,
	LobbyAnim_EOMBackground        = 12,
	LobbyAnim_PostMatchWalk        = 13,
	LobbyAnim_MidSequence          = 14,
	LobbyAnim_MAX                  = 15
};


// Enum Killstreak.ELobbyPresenceState
enum class ELobbyPresenceState : uint8_t
{
	ELobbyPresence_Unknown         = 0,
	ELobbyPresence_NotPresent      = 1,
	ELobbyPresence_PendingInvite   = 2,
	ELobbyPresence_Idle            = 3,
	ELobbyPresence_MAX             = 4
};


// Enum Killstreak.ELobbyLevelSequenceTag
enum class ELobbyLevelSequenceTag : uint8_t
{
	ELobbyLvlSeqTag_Login          = 0,
	ELobbyLvlSeqTag_MAX            = 1
};


// Enum Killstreak.ELobbyCameraActorTag
enum class ELobbyCameraActorTag : uint8_t
{
	ELobbyCamTag_Home              = 0,
	ELobbyCamTag_CustomizeLoadout  = 1,
	ELobbyCamTag_LobbyMain         = 2,
	ELobbyCamTag_MAX               = 3
};


// Enum Killstreak.ELootSiteAlignment
enum class ELootSiteAlignment : uint8_t
{
	Attack                         = 0,
	Defend                         = 1,
	Contested                      = 2,
	ELootSiteAlignment_MAX         = 3
};


// Enum Killstreak.EKSMantleScaleType
enum class EKSMantleScaleType : uint8_t
{
	ScaleDistOnly                  = 0,
	ScaleDistAndTime               = 1,
	ShaveIntro                     = 2,
	EKSMantleScaleType_MAX         = 3
};


// Enum Killstreak.EKSMercMasteryActivityType
enum class EKSMercMasteryActivityType : uint8_t
{
	None                           = 0,
	MercXp                         = 1,
	Kills                          = 2,
	Deaths                         = 3,
	Damage                         = 4,
	Downs                          = 5,
	GamesPlayed                    = 6,
	GamesWon                       = 7,
	MinutesPlayed                  = 8,
	Headshots                      = 9,
	Revives                        = 10,
	MAX                            = 11
};


// Enum Killstreak.EKSRelativeMinimapHeight
enum class EKSRelativeMinimapHeight : uint8_t
{
	Below                          = 0,
	SameLevel                      = 1,
	Above                          = 2,
	EKSRelativeMinimapHeight_MAX   = 3
};


// Enum Killstreak.EThrowDirection
enum class EThrowDirection : uint8_t
{
	Back                           = 0,
	Front                          = 1,
	Left                           = 2,
	Right                          = 3,
	EThrowDirection_MAX            = 4
};


// Enum Killstreak.EKSNPEActivityType
enum class EKSNPEActivityType : uint8_t
{
	None                           = 0,
	TutorialCompleted              = 1,
	TutorialSkipped                = 2,
	MAX                            = 3
};


// Enum Killstreak.EObjectiveIconType
enum class EObjectiveIconType : uint8_t
{
	Hack                           = 0,
	Pickup                         = 1,
	EObjectiveIconType_MAX         = 2
};


// Enum Killstreak.EObjectiveType
enum class EObjectiveType : uint8_t
{
	None                           = 0,
	ExtractionPC                   = 1,
	BombZone                       = 2,
	EObjectiveType_MAX             = 3
};


// Enum Killstreak.EKSNavAreaType
enum class EKSNavAreaType : uint8_t
{
	Jump                           = 0,
	Hazard                         = 1,
	StartZipline                   = 2,
	TravelZipline                  = 3,
	Swim                           = 4,
	InteractiveObstacle            = 5,
	EKSNavAreaType_MAX             = 6
};


// Enum Killstreak.EKSInputType
enum class EKSInputType : uint8_t
{
	KBM                            = 0,
	GP                             = 1,
	Touch                          = 2,
	EKSInputType_MAX               = 3
};


// Enum Killstreak.EKSKeyBindType
enum class EKSKeyBindType : uint8_t
{
	ActionMapping                  = 0,
	AxisMapping                    = 1,
	EKSKeyBindType_MAX             = 2
};


// Enum Killstreak.EModPriorityResolution
enum class EModPriorityResolution : uint8_t
{
	TakeValue1                     = 0,
	TakeValue2                     = 1,
	Stack                          = 2,
	EModPriorityResolution_MAX     = 3
};


// Enum Killstreak.EPlayerModType
enum class EPlayerModType : uint8_t
{
	Perk                           = 0,
	GlobalPerk                     = 1,
	Activated                      = 2,
	TemporaryBuff                  = 3,
	TemporaryDebuff                = 4,
	Hidden                         = 5,
	Unknown                        = 6,
	EPlayerModType_MAX             = 7
};


// Enum Killstreak.EModInterferenceType
enum class EModInterferenceType : uint8_t
{
	Defer                          = 0,
	Stack                          = 1,
	WeakestWins                    = 2,
	StrongestWins                  = 3,
	BonusWins                      = 4,
	PenaltyWins                    = 5,
	EModInterferenceType_MAX       = 6
};


// Enum Killstreak.EEliminationState
enum class EEliminationState : uint8_t
{
	NotInPlay                      = 0,
	Playing                        = 1,
	Eliminated                     = 2,
	EEliminationState_MAX          = 3
};


// Enum Killstreak.EIsPlayer
enum class EIsPlayer : uint8_t
{
	Unknown                        = 0,
	Player                         = 1,
	NotPlayer                      = 2,
	EIsPlayer_MAX                  = 3
};


// Enum Killstreak.EKSPlayerStatsActivityType
enum class EKSPlayerStatsActivityType : uint8_t
{
	None                           = 0,
	PlayerXp                       = 1,
	Kills                          = 2,
	Deaths                         = 3,
	Damage                         = 4,
	Downs                          = 5,
	GamesPlayed                    = 6,
	GamesWon                       = 7,
	MinutesPlayed                  = 8,
	Headshots                      = 9,
	Revives                        = 10,
	MAX                            = 11
};


// Enum Killstreak.EProjectilePredictionType
enum class EProjectilePredictionType : uint8_t
{
	PassThrough                    = 0,
	Bounce                         = 1,
	Stop                           = 2,
	EProjectilePredictionType_MAX  = 3
};


// Enum Killstreak.EProjectileVisibilityType
enum class EProjectileVisibilityType : uint8_t
{
	Owner                          = 0,
	Ally                           = 1,
	All                            = 2,
	EProjectileVisibilityType_MAX  = 3
};


// Enum Killstreak.ERecoilStart2
enum class ERecoilStart2 : uint8_t
{
	ERS_Zero2                      = 0,
	ERS_Random2                    = 1,
	ERS_MAX                        = 2
};


// Enum Killstreak.EPlayerStatType
enum class EPlayerStatType : uint8_t
{
	UNKNOWN                        = 0,
	Kills                          = 1,
	Deaths                         = 2,
	Assists                        = 3,
	Downs                          = 4,
	Revives                        = 5,
	Eliminations                   = 6,
	RoundsPlayed                   = 7,
	Hacks                          = 8,
	Dehacks                        = 9,
	RawDamageDealt                 = 10,
	MitigatedDamageDealt           = 11,
	RawDamageReceived              = 12,
	MitigatedDamageReceived        = 13,
	TimeAlive                      = 14,
	Rank                           = 15,
	TimePlayed                     = 16,
	Score                          = 17,
	Cash                           = 18,
	EPlayerStatType_MAX            = 19
};


// Enum Killstreak.ELimitPerRound
enum class ELimitPerRound : uint8_t
{
	None                           = 0,
	OneActive                      = 1,
	OnePerRound                    = 2,
	ELimitPerRound_MAX             = 3
};


// Enum Killstreak.ELocalRequirements
enum class ELocalRequirements : uint8_t
{
	None                           = 0,
	Controlled                     = 1,
	Viewed                         = 2,
	ControlledOrViewed             = 3,
	ELocalRequirements_MAX         = 4
};


// Enum Killstreak.EPlayerShopTransactionType
enum class EPlayerShopTransactionType : uint8_t
{
	Purchase                       = 0,
	SetActive                      = 1,
	EPlayerShopTransactionType_MAX = 2
};


// Enum Killstreak.ESpecialtyRoleType
enum class ESpecialtyRoleType : uint8_t
{
	Unknown                        = 0,
	Attack                         = 1,
	Defense                        = 2,
	Support                        = 3,
	Movement                       = 4,
	ESpecialtyRoleType_MAX         = 5
};


// Enum Killstreak.EExtractionTeamType
enum class EExtractionTeamType : uint8_t
{
	NotSet                         = 0,
	Attacker                       = 1,
	Defender                       = 2,
	EExtractionTeamType_MAX        = 3
};


// Enum Killstreak.ECameraShoulder
enum class ECameraShoulder : uint8_t
{
	Right                          = 0,
	Left                           = 1,
	ECameraShoulder_MAX            = 2
};


// Enum Killstreak.EControllerInputType
enum class EControllerInputType : uint8_t
{
	None                           = 0,
	ADSBit                         = 1,
	KeyboardMouse                  = 2,
	KeyboardMouseADS               = 3,
	Gamepad                        = 4,
	GamepadADS                     = 5,
	JoyCon                         = 6,
	JoyConADS                      = 7,
	Touch                          = 8,
	TouchADS                       = 9,
	EControllerInputType_MAX       = 10
};


// Enum Killstreak.EOcclusionType
enum class EOcclusionType : uint8_t
{
	None                           = 0,
	Simple                         = 1,
	Advanced                       = 2,
	EOcclusionType_MAX             = 3
};


// Enum Killstreak.EKSPowerSlideEndReason
enum class EKSPowerSlideEndReason : uint8_t
{
	Expired                        = 0,
	Collide                        = 1,
	Fall                           = 2,
	Action                         = 3,
	Interrupted                    = 4,
	FaceAway                       = 5,
	Unknown                        = 6,
	EKSPowerSlideEndReason_MAX     = 7
};


// Enum Killstreak.EKSGame_CustomMovement
enum class EKSGame_CustomMovement : uint8_t
{
	KSMOVE_Vaulting                = 0,
	KSMOVE_DiveFreeFall            = 1,
	KSMOVE_DiveParachute           = 2,
	KSMOVE_DodgeRoll               = 3,
	KSMOVE_ZipLine                 = 4,
	KSMOVE_FlightRecovery          = 5,
	KSMOVE_Ability                 = 6,
	KSMOVE_PowerSlide              = 7,
	KSMOVE_Kick                    = 8,
	KSMOVE_MAX                     = 9
};


// Enum Killstreak.EKSRespawnMode
enum class EKSRespawnMode : uint8_t
{
	NoRespawn                      = 0,
	TicketRespawn                  = 1,
	AlwaysRespawn                  = 2,
	EKSRespawnMode_MAX             = 3
};


// Enum Killstreak.EKSMovementDirection
enum class EKSMovementDirection : uint8_t
{
	Forward                        = 0,
	Right                          = 1,
	Back                           = 2,
	Left                           = 3,
	EKSMovementDirection_MAX       = 4
};


// Enum Killstreak.EKSApparelGender
enum class EKSApparelGender : uint8_t
{
	Unisex                         = 0,
	Male                           = 1,
	Female                         = 2,
	EKSApparelGender_MAX           = 3
};


// Enum Killstreak.EKSCharacterGender
enum class EKSCharacterGender : uint8_t
{
	Unknown                        = 0,
	Male                           = 1,
	Female                         = 2,
	EKSCharacterGender_MAX         = 3
};


// Enum Killstreak.ECombatState
enum class ECombatState : uint8_t
{
	Combat                         = 0,
	Engaged                        = 1,
	NonCombat                      = 2,
	ECombatState_MAX               = 3
};


// Enum Killstreak.EPlayerSilhouetteType
enum class EPlayerSilhouetteType : uint8_t
{
	None                           = 0,
	Neutral                        = 1,
	Selected                       = 2,
	Friendly                       = 3,
	Enemy                          = 4,
	EPlayerSilhouetteType_MAX      = 5
};


// Enum Killstreak.EDamageCategory
enum class EDamageCategory : uint8_t
{
	Default                        = 0,
	NonDamage                      = 1,
	Firearm                        = 2,
	Impact                         = 3,
	Explosion                      = 4,
	Melee                          = 5,
	InstantDeath                   = 6,
	Environmental                  = 7,
	Bleed                          = 8,
	Fire                           = 9,
	EDamageCategory_MAX            = 10
};


// Enum Killstreak.ELoadoutSlot
enum class ELoadoutSlot : uint8_t
{
	LoadoutSlot_None               = 0,
	LoadoutSlot_SpecialtyOne       = 1,
	LoadoutSlot_SpecialtyTwo       = 2,
	LoadoutSlot_PerkOne            = 3,
	LoadoutSlot_PerkTwo            = 4,
	LoadoutSlot_PerkFour           = 5,
	LoadoutSlot_KillstreakOne      = 6,
	LoadoutSlot_KillstreakTwo      = 7,
	LoadoutSlot_Pistol             = 8,
	LoadoutSlot_PistolAttachOne    = 9,
	LoadoutSlot_PistolAttachTwo    = 10,
	LoadoutSlot_PistolAttachThree  = 11,
	LoadoutSlot_PrimaryWeapon      = 12,
	LoadoutSlot_PerkThree          = 13,
	LoadoutSlot_GadgetOne          = 14,
	LoadoutSlot_PassiveOne         = 15,
	LoadoutSlot_PassiveTwo         = 16,
	LoadoutSlot_SecondaryAbilityOne = 17,
	LoadoutSlot_SecondaryAbilityTwo = 18,
	LoadoutSlot_LoadoutBundleId    = 19,
	LoadoutSlot_MAX                = 20
};


// Enum Killstreak.TG_EQUIP_POINT
enum class ETG_EQUIP_POINT : uint8_t
{
	EQP_NONE                       = 0,
	EQP_AUTO                       = 1,
	EQP_OFFHAND                    = 2,
	EQP_OFFHAND01                  = 3,
	EQP_OFFHAND02                  = 4,
	EQP_OFFHAND03                  = 5,
	EQP_RECALL                     = 6,
	EQP_PASSIVE                    = 7,
	EQP_ACTIVE                     = 8,
	EQP_ACTIVE01                   = 9,
	EQP_ACTIVE02                   = 10,
	EQP_CONSUMABLE                 = 11,
	EQP_CONSUMABLE01               = 12,
	EQP_UNUSED                     = 13,
	EQP_UNUSED01                   = 14,
	EQP_UNUSED02                   = 15,
	EQP_UNUSED03                   = 16,
	EQP_UNUSED04                   = 17,
	EQP_UNUSED05                   = 18,
	EQP_ITEM_STORE                 = 19,
	EQP_ITEM_STORE01               = 20,
	EQP_ITEM_STORE02               = 21,
	EQP_ITEM_STORE03               = 22,
	EQP_ITEM_STORE04               = 23,
	EQP_OVER_DRAW                  = 24,
	EQP_MAX                        = 25
};


// Enum Killstreak.EKSWeaponDestroyReason
enum class EKSWeaponDestroyReason : uint8_t
{
	None                           = 0,
	RemoveNoReplace                = 1,
	RemoveWithReplace              = 2,
	DropNoReplace                  = 3,
	DropWithReplace                = 4,
	EKSWeaponDestroyReason_MAX     = 5
};


// Enum Killstreak.EReloadReplicationFlags
enum class EReloadReplicationFlags : uint8_t
{
	MinimumReplication             = 0,
	ReplicateAmmo                  = 1,
	EReloadReplicationFlags_MAX    = 2
};


// Enum Killstreak.EFiredReplicationFlags
enum class EFiredReplicationFlags : uint8_t
{
	MinimumReplication             = 0,
	ReplicateAmmo                  = 1,
	ReplicateAim                   = 2,
	ReplicateAimAndAmmo            = 3,
	ReplicateAllFireParameters     = 4,
	EFiredReplicationFlags_MAX     = 5
};


// Enum Killstreak.EKSBuildState
enum class EKSBuildState : uint8_t
{
	BUILD_PENDING_VALID            = 0,
	BUILD_PENDING_INVALID          = 1,
	BUILD_SUCCEEDED                = 2,
	BUILD_FAILED                   = 3,
	BUILD_MAX                      = 4
};


// Enum Killstreak.EThirdPersonAimOriginType
enum class EThirdPersonAimOriginType : uint8_t
{
	ActorEyes                      = 0,
	FixedRelativeLocation          = 1,
	ComponentByTag                 = 2,
	SocketOnCharacterMesh          = 3,
	EThirdPersonAimOriginType_MAX  = 4
};


// Enum Killstreak.EReticleType
enum class EReticleType : uint8_t
{
	Pistol                         = 0,
	Rifle                          = 1,
	Shotgun                        = 2,
	DualAR                         = 3,
	EReticleType_MAX               = 4
};


// Enum Killstreak.EReloadType
enum class EReloadType : uint8_t
{
	Clip                           = 0,
	SingleShot                     = 1,
	EReloadType_MAX                = 2
};


// Enum Killstreak.EFireModeType
enum class EFireModeType : uint8_t
{
	Single                         = 0,
	Burst                          = 1,
	SemiAuto                       = 2,
	EFireModeType_MAX              = 3
};


// Enum Killstreak.EExtendedMagazineRounding
enum class EExtendedMagazineRounding : uint8_t
{
	NearestInteger                 = 0,
	RoundUp                        = 1,
	RoundDown                      = 2,
	EExtendedMagazineRounding_MAX  = 3
};


// Enum Killstreak.EKSVariableScopeType
enum class EKSVariableScopeType : uint8_t
{
	FixedFOV                       = 0,
	ScopeMultiplier                = 1,
	EKSVariableScopeType_MAX       = 2
};


// Enum Killstreak.EBundledAmmoType
enum class EBundledAmmoType : uint8_t
{
	FullClip                       = 0,
	DefaultAmmoFromAsset           = 1,
	Override                       = 2,
	EBundledAmmoType_MAX           = 3
};


// Enum Killstreak.EWeaponComponentAttachmentType
enum class EWeaponComponentAttachmentType : uint8_t
{
	AttachToCharacter              = 0,
	AttachToMesh                   = 1,
	EWeaponComponentAttachmentType_MAX = 2
};


// Enum Killstreak.ESkinObjectParentingType
enum class ESkinObjectParentingType : uint8_t
{
	Never                          = 0,
	ActiveAndMainHand              = 1,
	Active                         = 2,
	InAction                       = 3,
	Always                         = 4,
	ESkinObjectParentingType_MAX   = 5
};


// Enum Killstreak.EWeaponComponentTickType
enum class EWeaponComponentTickType : uint8_t
{
	NeverTick                      = 0,
	TickWhenActive                 = 1,
	AlwaysTick                     = 2,
	EWeaponComponentTickType_MAX   = 3
};


// Enum Killstreak.EKSWeaponMasteryActivityType
enum class EKSWeaponMasteryActivityType : uint8_t
{
	None                           = 0,
	Shots                          = 1,
	Hits                           = 2,
	Damage                         = 3,
	Downs                          = 4,
	Kills                          = 5,
	Headshots                      = 6,
	Deaths                         = 7,
	MAX                            = 8
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Killstreak.KSVoicelineEvent
// 0x0024
struct FKSVoicelineEvent
{
	struct FName                                       EventName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EKSVoicelineAudience                               Audience;                                                 // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              ActivationChance;                                         // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAffectedByGlobalCooldown;                                // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                CooldownGroup;                                            // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CooldownDuration;                                         // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              VoicelineChangeValue;                                     // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bPlayedByOwnerAlready;                                    // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
};

// ScriptStruct Killstreak.AccoladeDisplayInfo
// 0x0058
struct FAccoladeDisplayInfo
{
	EAccoladeCategory                                  Category;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAccoladeEventType                                 Type;                                                     // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	class UTexture2D*                                  DisplayIcon;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       DisplayTitle;                                             // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	float                                              DisplayDuration;                                          // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                Multiplier;                                               // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FKSVoicelineEvent                           AccoladeVoiceLine;                                        // 0x0030(0x0024) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct Killstreak.CombatEventInfo
// 0x0058
struct FCombatEventInfo
{
	TWeakObjectPtr<class APlayerState>                 EventVictim;                                              // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class APlayerState>                 EventInstigator;                                          // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AController>                  InstigatorController;                                     // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class APlayerState>>         EventAssistants;                                          // 0x0018(0x0010) (ZeroConstructor)
	TWeakObjectPtr<class AActor>                       DamagedActor;                                             // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       DamageCauser;                                             // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageType;                                               // 0x0038(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSWeaponAsset*                              WeaponAsset;                                              // 0x0040(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DownEvent;                                                // 0x0048(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               KillEvent;                                                // 0x0049(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EHitLocationType                                   HitLocationType;                                          // 0x004A(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x004B(0x0001) MISSED OFFSET
	float                                              DamageDealt;                                              // 0x004C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              OriginalDamageDealt;                                      // 0x0050(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsArmorHit;                                               // 0x0054(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
};

// ScriptStruct Killstreak.ActivityAchievementInfo
// 0x0058
struct FActivityAchievementInfo
{
	bool                                               bIsAchievement;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TMap<struct FName, struct FString>                 AchievementIdByOSSName;                                   // 0x0008(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Killstreak.ActivityReference
// 0x0030
struct FActivityReference
{
	int64_t                                            ReferenceValue1;                                          // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int64_t                                            ReferenceValue2;                                          // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int64_t                                            ReferenceValue3;                                          // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0018(0x0018) MISSED OFFSET
};

// ScriptStruct Killstreak.ActivityTier
// 0x0010
struct FActivityTier
{
	int                                                Tier;                                                     // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int64_t                                            LootId;                                                   // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Killstreak.KSBTDifficultyConfig
// 0x0078
struct FKSBTDifficultyConfig
{
	float                                              AccuracyMultiplierStandard;                               // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AccuracyMultiplierThrownMelee;                            // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AccuracyMultiplierWhenBlinded;                            // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AccuracyMultiplierWhenCrosshairHidden;                    // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NewTargetAccuracyMultiplier;                              // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              NewTargetTime;                                            // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpeedMultiplier;                                          // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttackDelayClipPercentMin;                                // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttackDelayClipPercentMax;                                // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttackDelay;                                              // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageDealtMultiplier;                                    // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              HeadshotDamageDealtMultiplier;                            // 0x002C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageTakenMultiplier;                                    // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              HeadshotDamageTakenMultiplier;                            // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AimForHeadshotProbability;                                // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DodgeRollProbability;                                     // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StrafeProbability;                                        // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ThrowGrenadeProbability;                                  // 0x0044(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ThrowMeleeProbability;                                    // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PerceptionStrengthMin;                                    // 0x004C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PerceptionStrengthMax;                                    // 0x0050(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	TArray<class UKSBTAction*>                         AllowedActions;                                           // 0x0058(0x0010) (Edit, ZeroConstructor)
	TArray<class UKSBTAction*>                         DisallowedActions;                                        // 0x0068(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Killstreak.KSInitialLoadout
// 0x0010
struct FKSInitialLoadout
{
	TArray<class UKSItem*>                             LoadoutItems;                                             // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Killstreak.KSBTItemPriorityTableRow
// 0x0038 (0x0040 - 0x0008)
struct FKSBTItemPriorityTableRow : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0008(0x0028) UNKNOWN PROPERTY: SoftObjectProperty Killstreak.KSBTItemPriorityTableRow.ItemAsset
	float                                              Weight;                                                   // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ShopPurchaseWeight;                                       // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ShopPriorityGroup;                                        // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Multiplier;                                               // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Killstreak.AimAssistActorHealthInfo
// 0x0008
struct FAimAssistActorHealthInfo
{
	float                                              CurrentHealth;                                            // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bKilled;                                                  // 0x0004(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Killstreak.RankedAimAssistTarget
// 0x0048
struct FRankedAimAssistTarget
{
	class UKSAimAssistAnchorComponent*                 Anchor;                                                   // 0x0000(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	TScriptInterface<class UKSAimAssistTargetInterface> Target;                                                   // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              HeadWeight;                                               // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
