#pragma once

// RogueCompany (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class KillstreakUINew.KSWidget
// 0x0040 (0x04C8 - 0x0488)
class UKSWidget : public UPUMG_Widget
{
public:
	bool                                               bIsUIOnlyWidget;                                          // 0x0488(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsExclusiveMenuWidget;                                   // 0x0489(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x048A(0x0006) MISSED OFFSET
	class UTickAnimationManager*                       TickAnimations;                                           // 0x0490(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ViewportEvent;                                            // 0x0498(0x0010) (ZeroConstructor, InstancedReference)
	bool                                               bSubstituteKillCamWorld;                                  // 0x04A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSubstituteKillCamOwningPlayer;                           // 0x04A9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWantsKillCamCallbacks;                                   // 0x04AA(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1D];                                      // 0x04AB(0x001D) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSWidget");
		return ptr;
	}


	void UnbindFromViewportSizeChange();
	void StopTickAnimation(struct FName* AnimName);
	void SkipToEndTickAnimation(struct FName* AnimName);
	void SetAllAnimationsPlaybackSpeed(float* PlaybackSpeed);
	void ResumeTickAnimation(struct FName* AnimName);
	void RemoveTickAnimation(struct FName* AnimName);
	void PlayTickAnimation(struct FName* AnimName);
	void PauseTickAnimation(struct FName* AnimName);
	bool IsInKillCamPlayback();
	void InitializeTickAnimations();
	bool GetTickAnimationInfo(struct FName* AnimName, struct FTickAnimationParams* OutAnimParams);
	class APlayerController* GetNormalOwningPlayer();
	class APlayerController* GetKillCamSpectatorController();
	class APlayerController* GetActivePlayerController();
	void BlueprintPrepareKillCamPlayback();
	void BlueprintFinishKillCamPlayback();
	void BindToViewportSizeChange(struct FScriptDelegate* InViewportEvent);
	void AddTickAnimation(struct FName* AnimName, float* Duration, struct FScriptDelegate* UpdateEvent, struct FScriptDelegate* FinishedEvent);
};


// Class KillstreakUINew.KSAccoladeQueueWidget
// 0x0048 (0x0510 - 0x04C8)
class UKSAccoladeQueueWidget : public UKSWidget
{
public:
	bool                                               IsBusy;                                                   // 0x04C8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x04C9(0x0003) MISSED OFFSET
	int                                                NumInQueue;                                               // 0x04CC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnAccoladeReceived;                                       // 0x04D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAccoladeUpdateMultiplier;                               // 0x04E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x20];                                      // 0x04F0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAccoladeQueueWidget");
		return ptr;
	}


	void Queue(TArray<struct FAccoladeEventEntry>* Accolades);
	void OnAccoladeRemovedFromScreen(struct FAccoladeDisplayInfo* AccoladeRemoved);
	bool GetNext(struct FAccoladeDisplayInfo* Accolade);
	void ClearAccoladeQueue();
};


// Class KillstreakUINew.KSAcquisitionModal
// 0x0000 (0x04C8 - 0x04C8)
class UKSAcquisitionModal : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAcquisitionModal");
		return ptr;
	}


	void SetupBindings();
	void HandleShowAcquisitionModal(class UPUMG_StoreItem** pItem);
	class UPUMG_AcquisitionManager* GetAcquisitionManager();
};


// Class KillstreakUINew.KSPawnWidget
// 0x0020 (0x04E8 - 0x04C8)
class UKSPawnWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x04C8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSPawnWidget");
		return ptr;
	}


	void SetPlayerStateUIRelevanceChanged();
	void SetPawn(class AKSCharacter** NewPawn);
	void PreClearPlayerState();
	void PreClearPawn();
	void PostSetPlayerState();
	void PostSetPawn();
	void OnBoundPlayerStateDestroyed(class AActor** DestroyedActor);
	void OnBoundPawnDestroyed(class AActor** DestroyedActor);
	class AKSPlayerState* GetPlayerState();
	class AKSCharacterBase* GetPawnBase();
	class AKSCharacter* GetPawn();
};


// Class KillstreakUINew.KSPawnInventoryWidget
// 0x0070 (0x0558 - 0x04E8)
class UKSPawnInventoryWidget : public UKSPawnWidget
{
public:
	TMap<uint16_t, class UKSWeaponComponentWidget*>    EquipmentWidgets;                                         // 0x04E8(0x0050) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0538(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSPawnInventoryWidget");
		return ptr;
	}


	bool RemoveWidgetFor(class UKSWeaponComponent** InWeaponComponent);
	class UKSWeaponComponentWidget* GetWidgetForWeaponComponent(class UKSWeaponComponent** InWeaponComponent);
	void EquipmentRemoved(class UKSWeaponComponent** RemovedEquipment);
	void EquipmentEndActive(class UKSWeaponComponent** InactiveEquipment);
	void EquipmentBecomeActive(class UKSWeaponComponent** ActiveEquipment);
	void EquipmentAdded(class UKSWeaponComponent** AddedEquipment);
	class UKSWeaponComponentWidget* CreateWeaponComponentWidgetFor(class UObject** WorldContextObject, class UKSWeaponComponent** InWeaponComponent, class UClass** WidgetClass, class APlayerController** OwningPlayer);
};


// Class KillstreakUINew.KSActiveWeaponComponentWidget
// 0x0038 (0x0590 - 0x0558)
class UKSActiveWeaponComponentWidget : public UKSPawnInventoryWidget
{
public:
	int                                                ActiveWeaponSlot;                                         // 0x0558(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x055C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       EquipPointsToIgnore;                                      // 0x0560(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                               bDelayClearUntilNextTick;                                 // 0x0580(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0581(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UKSWeaponComponent>           WeakActiveWeaponComponentPtr;                             // 0x0584(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x058C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSActiveWeaponComponentWidget");
		return ptr;
	}


	void PreClearActiveWeaponComponent();
	void PostSetActiveWeaponComponent();
	class UKSWeaponComponent* GetActiveWeaponComponent();
};


// Class KillstreakUINew.KSAimAssistDebugWidget
// 0x0008 (0x04D0 - 0x04C8)
class UKSAimAssistDebugWidget : public UKSWidget
{
public:
	bool                                               bDrawAimAssistBoundary;                                   // 0x04C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDrawHeadAimCorrectionBoundary;                           // 0x04C9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDrawMagnetismDebug;                                      // 0x04CA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDrawTargetInfo;                                          // 0x04CB(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x04CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAimAssistDebugWidget");
		return ptr;
	}


	class AKSPlayerController* GetOwningKSPlayer();
	class UKSAimAssistComponent* GetAimAssistComponent();
};


// Class KillstreakUINew.KSMapIconWidgetBase
// 0x0060 (0x0290 - 0x0230)
class UKSMapIconWidgetBase : public UUserWidget
{
public:
	bool                                               bDoesIconRotate;                                          // 0x0230(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0231(0x0003) MISSED OFFSET
	float                                              MarkerAnchorHeight;                                       // 0x0234(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HeightThreshold;                                          // 0x0238(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x023C(0x0004) MISSED OFFSET
	int                                                UniqueId;                                                 // 0x0240(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       AssociatedActor;                                          // 0x0244(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UObject>                      AssociatedObject;                                         // 0x024C(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DefaultLocation;                                          // 0x0254(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LifeSpan;                                                 // 0x0260(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ScreenMargins;                                            // 0x0264(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UKSMapWidgetBase>             ParentMapWidget;                                          // 0x026C(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0274(0x0004) MISSED OFFSET
	float                                              HoverDelaySeconds;                                        // 0x0278(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x14];                                      // 0x027C(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSMapIconWidgetBase");
		return ptr;
	}


	void UpdateScreenRegion();
	void UpdateMetersAway(int* Meters);
	void UpdateMeetsHeightThreshold(bool* bHeight, bool* bDepth);
	ESlateVisibility Update();
	bool ShouldUpdateHover();
	bool ShouldUpdate();
	void SetScreenRegion(EIconMarkerScreenRegion* ScreenRegion);
	void SetLifeSpan(float* InLifespan);
	void SetArrowAngle(float* Angle);
	void OnUnhoverTimerComplete();
	void OnHoverTimerComplete();
	void OnHoverStateChanged(EIconHoverState* NewHoverState);
	void OnAssociatedActorDestroyed(class AActor** Actor);
	bool IsHovering();
	float GetWorldYaw();
	struct FVector GetWorldPosition();
	EIconHoverState GetHoverState();
	float GetDistanceToIcon();
};


// Class KillstreakUINew.KSAllyMarkerWidget
// 0x0038 (0x02C8 - 0x0290)
class UKSAllyMarkerWidget : public UKSMapIconWidgetBase
{
public:
	class UWidget*                                     ArrowWidget;                                              // 0x0290(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidget*                                     NameOrStatusWidget;                                       // 0x0298(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidget*                                     DownedSectionWidget;                                      // 0x02A0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x02A8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAllyMarkerWidget");
		return ptr;
	}


	void View_SetRevivePercent(float* PercentValue);
	void View_SetNameText(struct FText* NameText);
	void View_SetMode(EAllyMarkerState* AllyMarkerState, bool* HasBomb);
	void View_SetJob(class UKSJobItem** Job);
	void View_SetHealthPercent(float* PercentValue);
	void HandlePlayerDown(struct FCombatEventInfo* CombatEventInfo, int* ExpBonus);
	void HandlePlayerDeath(struct FCombatEventInfo* DeathInfo);
	void HandleOnJobChanged();
	void HandleBombStateChanged(struct FKSNeutralBombState* BombState);
	struct FVector2D GetArrowPositionFromAngleBlueprint(float* Angle);
};


// Class KillstreakUINew.KSAlphaDisclaimer
// 0x0000 (0x04C8 - 0x04C8)
class UKSAlphaDisclaimer : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAlphaDisclaimer");
		return ptr;
	}


	bool STATIC_LoadAlphaDisclaimerText(struct FString* SaveText);
};


// Class KillstreakUINew.KSWeaponWidget
// 0x0008 (0x04D0 - 0x04C8)
class UKSWeaponWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04C8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSWeaponWidget");
		return ptr;
	}


	void SetOwningWeapon(class AKSWeapon** InWeapon);
	void PreClearWeapon();
	void PostSetWeapon();
	void OtherWeaponUpdate();
	void OnOwningWeaponDestroyed(class AActor** DestroyedWeapon);
	class AKSWeapon* GetOwningWeapon();
};


// Class KillstreakUINew.KSAmmoWidget
// 0x0020 (0x04F0 - 0x04D0)
class UKSAmmoWidget : public UKSWeaponWidget
{
public:
	int                                                CachedAmmoInClip;                                         // 0x04D0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CachedClipSize;                                           // 0x04D4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CachedInReserve;                                          // 0x04D8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CachedIsReloading;                                        // 0x04DC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x13];                                      // 0x04DD(0x0013) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAmmoWidget");
		return ptr;
	}


	void StopReloading();
	void StartReloading();
	void OnAmmoChanged(int* OldInClip, int* OldClipSize, int* OldReserve, int* NewInClip, int* NewClipSize, int* NewReserve);
};


// Class KillstreakUINew.KSAnnouncementQueuedMessageWidget
// 0x0048 (0x0510 - 0x04C8)
class UKSAnnouncementQueuedMessageWidget : public UKSWidget
{
public:
	struct FScriptMulticastDelegate                    OnEndDisplay;                                             // 0x04C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FAnnouncementData                           _AnnouncementData;                                        // 0x04D8(0x0038) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAnnouncementQueuedMessageWidget");
		return ptr;
	}


	void DisplayAnnouncement();
};


// Class KillstreakUINew.KSAnnouncementQueueWidget
// 0x0028 (0x04F0 - 0x04C8)
class UKSAnnouncementQueueWidget : public UKSWidget
{
public:
	bool                                               IsBusy;                                                   // 0x04C8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x04C9(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReadyForNextAnnouncement;                               // 0x04D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x10];                                      // 0x04E0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAnnouncementQueueWidget");
		return ptr;
	}


	void Queue(struct FAnnouncementData* Announcement);
	bool GetNext(struct FAnnouncementData* Announcement);
	void ClearAnnoucementQueue();
};


// Class KillstreakUINew.KSAsyncImage
// 0x0038 (0x0290 - 0x0258)
class UKSAsyncImage : public UPUMG_AsyncImage
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0258(0x0028) UNKNOWN PROPERTY: SoftObjectProperty KillstreakUINew.KSAsyncImage.PendingIconTexture
	class UKSItem*                                     PendingItem;                                              // 0x0280(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0288(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSAsyncImage");
		return ptr;
	}


	void SetBrushFromTextureOnItem(class UKSItem** Item, bool* bMatchSize);
	void SetBrushFromItemIcon(class UKSItem** Item, bool* bMatchSize);
	void OnItemIconLoaded(class UTexture2D** ItemIcon);
};


// Class KillstreakUINew.KSChatDataFactory
// 0x0000 (0x0118 - 0x0118)
class UKSChatDataFactory : public UPUMG_ChatDataFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSChatDataFactory");
		return ptr;
	}

};


// Class KillstreakUINew.KSComponentReticleWidgetBase
// 0x0020 (0x05B0 - 0x0590)
class UKSComponentReticleWidgetBase : public UKSActiveWeaponComponentWidget
{
public:
	float                                              ShrinkAnimationTime;                                      // 0x0590(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockedShotIconMaxScale;                                  // 0x0594(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockedShotIconMinScale;                                  // 0x0598(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockedShotMinScaleSqDist;                                // 0x059C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bGrenadeCooking;                                          // 0x05A0(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bInADS;                                                   // 0x05A1(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCachedBlockIconVisible;                                  // 0x05A2(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x05A3(0x0001) MISSED OFFSET
	float                                              CachedWeaponAccuracy;                                     // 0x05A4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CachedReticleOffset;                                      // 0x05A8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x05AC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSComponentReticleWidgetBase");
		return ptr;
	}


	void ViewedPawnInstigatedDamageNotify(struct FCombatEventInfo* DamageInfo);
	void UpdateReticleOffset(float* OffsetFromCenterScreen);
	void UpdateBlockedShotIcon(bool* IconVisible, struct FVector2D* Translation, struct FVector2D* IconScale);
	void CalculateReticleOffset(float* DeltaTime);
	void CalculateBlockedShotIcon();
};


// Class KillstreakUINew.ContextActionData
// 0x0058 (0x0080 - 0x0028)
class UContextActionData : public UObject
{
public:
	struct FName                                       RowName;                                                  // 0x0028(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FContextAction                              RowData;                                                  // 0x0030(0x0040) (BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             OnContextAction;                                          // 0x0070(0x0010) (ZeroConstructor, InstancedReference)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.ContextActionData");
		return ptr;
	}


	void TriggerContextAction();
};


// Class KillstreakUINew.KSContextBarWidget
// 0x0068 (0x0530 - 0x04C8)
class UKSContextBarWidget : public UKSWidget
{
public:
	class UDataTable*                                  ContextActionDT;                                          // 0x04C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<struct FName, struct FRouteContextInfo>       RouteContextInfoMap;                                      // 0x04D0(0x0050) (ZeroConstructor)
	struct FName                                       ActiveRoute;                                              // 0x0520(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       OverrideRoute;                                            // 0x0528(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSContextBarWidget");
		return ptr;
	}


	void UpdateContextActions(TArray<class UContextActionData*>* ContextActions);
	void SetPrompts(struct FName* Route, TArray<struct FName>* ContextNames);
	void SetPromptAction(struct FName* Route, struct FName* ContextName, struct FScriptDelegate* EventCallback);
	void SetPrompt(struct FName* Route, struct FName* ContextName);
	void SetOverrideRoute(struct FName* Route);
	void SetActiveRoute(struct FName* Route);
	void RefreshContextBar();
	struct FName GetCurrentContextRoute();
	void ClearPromptByKey(struct FName* Route, struct FKey* Key);
	void ClearPrompt(struct FName* Route, struct FName* ContextName);
	void ClearOverrideRoute();
	void ClearAllPrompts(struct FName* Route);
};


// Class KillstreakUINew.KSContextualPingMarkerWidget
// 0x0050 (0x02E0 - 0x0290)
class UKSContextualPingMarkerWidget : public UKSMapIconWidgetBase
{
public:
	struct FScriptMulticastDelegate                    OnPingRemovedCalled;                                      // 0x0290(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FPingInfo                                   CurrentPingInfo;                                          // 0x02A0(0x0030) (BlueprintVisible)
	class UKSPingManager*                              _PingManager;                                             // 0x02D0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDataTable*                                  ContextualPingDT;                                         // 0x02D8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSContextualPingMarkerWidget");
		return ptr;
	}


	void SetupPingOnReady();
	void SetPingInfo(struct FPingInfo* PingInfoVal);
	void OnPingUnhovered();
	void OnPingHovered(int* PingId);
	void OnInitializePing();
	void HandleOnContextualPingRemoved(int* PingId, class AKSPlayerState** PingingPlayer);
	float GetPingLifeSpan(EPingType* PingType);
	bool GetPingIconByType(EPingType* PingType);
	bool GetPingColorByType(EPingType* PingType, struct FLinearColor* PingColor);
	bool FindRowByType(EPingType* PingType, struct FContextualPing* ContextualPingRow);
};


// Class KillstreakUINew.KSCustomizationSelection
// 0x0000 (0x04C8 - 0x04C8)
class UKSCustomizationSelection : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSCustomizationSelection");
		return ptr;
	}


	TArray<class UPUMG_StoreItem*> GetItemsForSlot(EMercCosmeticSlot* slotType, class UKSJobItem** JobItem);
	class UKSStoreItemHelper* GetItemHelper();
};


// Class KillstreakUINew.KSDebugMenu
// 0x0010 (0x04D8 - 0x04C8)
class UKSDebugMenu : public UKSWidget
{
public:
	TArray<struct FDebugMenuCommandInfo>               DebugCommands;                                            // 0x04C8(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSDebugMenu");
		return ptr;
	}


	bool GetSubmenu(struct FDebugMenuCommandInfo* BaseCommand, TArray<struct FDebugMenuCommandInfo>* Submenu);
	void GetSortedBaseDebugCommands(TArray<struct FDebugMenuCommandInfo>* SortedCommands);
	EConsoleCommandParamType GetParamTypeForSubCommand(struct FString* BaseCommandString);
};


// Class KillstreakUINew.KSEditableTextBox
// 0x0010 (0x0A38 - 0x0A28)
class UKSEditableTextBox : public UEditableTextBox
{
public:
	struct FScriptDelegate                             OnKeyDown;                                                // 0x0A28(0x0010) (Edit, ZeroConstructor, InstancedReference)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSEditableTextBox");
		return ptr;
	}

};


// Class KillstreakUINew.KSQueuedMessageWidget
// 0x0018 (0x04E0 - 0x04C8)
class UKSQueuedMessageWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x04C8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSQueuedMessageWidget");
		return ptr;
	}


	void QueueMessage(struct FText* Message);
	bool GetNextMessage(struct FText* Message);
};


// Class KillstreakUINew.KSEliminationMessageWidget
// 0x0030 (0x0510 - 0x04E0)
class UKSEliminationMessageWidget : public UKSQueuedMessageWidget
{
public:
	struct FScriptMulticastDelegate                    OnReceivedMessage;                                        // 0x04E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class APawn*                                       KillCamPawn;                                              // 0x04F0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x04F8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSEliminationMessageWidget");
		return ptr;
	}


	void QueueCombatMessage(struct FEliminationMessage* CombatMessage);
	void OnPlayerDownReceived(struct FCombatEventInfo* EventInfo);
	void OnPlayerDeathReceived(struct FCombatEventInfo* EventInfo);
	void OnPlayerAssistReceived(struct FAssistInfo* EventInfo);
	bool IsViewedPlayerStateSelf(class APlayerState** ViewedPlayerState);
	bool IsViewedKillCamPlayerState(class APlayerState** KillCamPlayerState);
	bool GetNextCombatMessage(struct FEliminationMessage* CombatMessage);
	void ClearCombatMessages();
};


// Class KillstreakUINew.KSEMODataFactory
// 0x00F0 (0x0128 - 0x0038)
class UKSEMODataFactory : public UPUMG_DataFactory
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	bool                                               haveRecieveMatchReport;                                   // 0x0040(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xA7];                                      // 0x0041(0x00A7) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnRewardsRecieved;                                        // 0x00E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerLeveledUp;                                        // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerProgressionRecieved;                              // 0x0108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0118(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSEMODataFactory");
		return ptr;
	}


	void LevelUp(struct FActivityTier* NewTier);
	bool IsLocalPlayer(int64_t* PlayerId);
	void HandlePlayerRewards(struct FPlayerRewardsSummary* PlayerRewardSummary);
	void HandleEOMDetail();
	struct FScoreboardStats GetScoreboardStats();
	struct FActivityTier GetPreviousTier(struct FActivityTier* CurrentTier);
	struct FPlayerRewardsSummary GetPlayerRewardsSummary();
	struct FActivityTier GetPlayerLastTier(int* PreviousXp);
	struct FActivityTier GetNextTier(struct FActivityTier* NextTier);
	bool FindPlayerProgressionActivity(class UKSActivityInstance** PlayerProgressionActivity);
	void ComputeEOMResults();
	void CalcPlayerProgression(int* XpEarned);
};


// Class KillstreakUINew.KSViewedPawnWidget
// 0x0010 (0x04F8 - 0x04E8)
class UKSViewedPawnWidget : public UKSPawnWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x04E8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSViewedPawnWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSExpDisplayWidget
// 0x0018 (0x0510 - 0x04F8)
class UKSExpDisplayWidget : public UKSViewedPawnWidget
{
public:
	bool                                               bIsWaitingForNextQueue;                                   // 0x04F8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x04F9(0x0017) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSExpDisplayWidget");
		return ptr;
	}


	void QueueExpDisplays(struct FExpDisplayInfo* ExpInfo);
	void NativeHandleDisplayExpInfo();
	bool GetNextExpDisplay(struct FExpDisplayInfo* ExpInfo);
	void DisplayExpInfo();
};


// Class KillstreakUINew.KSFloatTickLerpWidgetBase
// 0x0018 (0x0248 - 0x0230)
class UKSFloatTickLerpWidgetBase : public UUserWidget
{
public:
	float                                              LerpTime;                                                 // 0x0230(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LerpPower;                                                // 0x0234(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0238(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSFloatTickLerpWidgetBase");
		return ptr;
	}


	void SetTargetValue(float* Value);
	void SetLerpTime(float* Time);
	void SetLerpPower(float* Power);
	bool IsLerping();
	float GetCurrentValue();
	void ForceCurrentValue(float* Value);
	void DisplayForValue(float* Value);
};


// Class KillstreakUINew.KSFriendDataFactory
// 0x0000 (0x00F0 - 0x00F0)
class UKSFriendDataFactory : public UPUMG_FriendDataFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSFriendDataFactory");
		return ptr;
	}


	void UIX_ShowExternalProfile(int64_t* PlayerId);
	TArray<class UPUMG_PlayerInfo*> GetSuggestedFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetPendingFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetOnlineFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetFriends_Info();
	TArray<class UPUMG_PlayerInfo*> GetFriendRequests_Info();
};


// Class KillstreakUINew.KSMapWidgetBase
// 0x00B8 (0x0580 - 0x04C8)
class UKSMapWidgetBase : public UKSWidget
{
public:
	EDisplayType                                       MapDisplayType;                                           // 0x04C8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x04C9(0x0017) MISSED OFFSET
	TMap<class AKSPlayerState*, class UKSMapIconWidgetBase*> PlayerIconMap;                                            // 0x04E0(0x0050) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData01[0x40];                                      // 0x0530(0x0040) MISSED OFFSET
	bool                                               AbsoluteRotation;                                         // 0x0570(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CanBeScrambled;                                           // 0x0571(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsScrambled;                                              // 0x0572(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bAffectedByScramble;                                      // 0x0573(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x0574(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSMapWidgetBase");
		return ptr;
	}


	void UpdateIcon(class UKSMapIconWidgetBase** Icon);
	struct FVector2D ToIconRenderCoords(struct FVector2D* MapCoords);
	float ToIconRenderAngle(float* PlayerAngle);
	void TickCachedTransform();
	void SetScrambleState(bool* Scrambled);
	void OnScrambleStateChanged(bool* Scrambled);
	void OnReceiveDisplayWidgetInfo(struct FDisplayInfo* DisplayInfo);
	void OnGameStateSet(class AGameStateBase** GameStateBase);
	bool IsOnMap(struct FVector2D* MapCoords);
	float GetDistanceToIcon(class UKSMapIconWidgetBase** Icon);
	class APawn* GetCachedViewedPawn();
	struct FTransform GetCachedTransform();
	class UKSMapIconWidgetBase* CreateNewIconWidget(class UClass** WidgetClass, int* UniqueId, class AActor** AssociatedActor, class UObject** AssociatedObject, struct FVector* DefaultLocation, float* LifeSpan);
};


// Class KillstreakUINew.KSFullMapWidget
// 0x0010 (0x0590 - 0x0580)
class UKSFullMapWidget : public UKSMapWidgetBase
{
public:
	float                                              MinimapWidth;                                             // 0x0580(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0584(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSFullMapWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSHUDCommon
// 0x0068 (0x0588 - 0x0520)
class AKSHUDCommon : public APUMG_HUD
{
public:
	struct FScriptMulticastDelegate                    OnPreferredSiteUpdated;                                   // 0x0520(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UPUMG_LoginDataFactory*                      _LoginDataFactory;                                        // 0x0530(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSSettingsDataFactory*                      SettingsFactory;                                          // 0x0538(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSChatDataFactory*                          _ChatDataFactory;                                         // 0x0540(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSPartyDataFactory*                         _PartyDataFactory;                                        // 0x0548(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSLoadoutDataFactory*                       _LoadoutDataFactory;                                      // 0x0550(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSMercManager*                              _MercManager;                                             // 0x0558(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UKSNPEDataFactory*                           _NPEDataFactory;                                          // 0x0560(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bDisplayWatermark;                                        // 0x0568(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0569(0x0003) MISSED OFFSET
	float                                              WatermarkAlpha;                                           // 0x056C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetLeft;                                      // 0x0570(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetTop;                                       // 0x0574(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetRight;                                     // 0x0578(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkOffsetBottom;                                    // 0x057C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	float                                              WatermarkChangePositionTime;                              // 0x0580(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0584(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSHUDCommon");
		return ptr;
	}


	void ShowErrorPopup(struct FText* ErrorMsg);
	bool ShouldShowCrossplayIconForPlayer(int64_t* PlayerId);
	void SetPreferredSiteId(int* SiteId);
	void PrintToLog(struct FText* InText);
	void OpenTextChatToPlayer(class UPUMG_PlayerInfo** Player);
	void OpenOptionsMenu();
	void LogErrorMessage(struct FText* ErrorMsg);
	bool IsSamePortalAsLocalPlayer(int64_t* PlayerId);
	void HandleOpenTextChat(bool* BeginChatCommand);
	void HandleControllerDisconnect();
	class UKSUISessionManager* GetUISessionManager();
	void GetSiteList(TMap<int, struct FText>* OutSiteIdToNameMap);
	class UKSSettingsDataFactory* GetSettingsDataFactory();
	bool GetPreferredSiteId(int* OutSiteId);
	class UKSPartyDataFactory* GetPartyDataFactory();
	class UKSNPEDataFactory* GetNPEDataFactory();
	class UKSMercManager* GetMercManager();
	class UPUMG_LoginDataFactory* GetLoginDataFactory();
	class UKSLoadoutDataFactory* GetLoadoutDataFactory();
	class UKSStoreItemHelper* GetItemHelper();
	TArray<class UPanelWidget*> GetFocusableWidgetContainers();
	class UKSContextBarWidget* GetContextBarWidget();
	class UKSChatDataFactory* GetChatDataFactory();
	class UPUMG_AcquisitionManager* GetAcquisitionManager();
	void DisplayWatermark();
	void ApplySafeFrameScale(float* SafeFrameScale);
};


// Class KillstreakUINew.KSGameHUDNew
// 0x0010 (0x0598 - 0x0588)
class AKSGameHUDNew : public AKSHUDCommon
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0588(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSGameHUDNew");
		return ptr;
	}


	void UIX_ReturnLobby();
	bool UIX_ReportPlayer(class AKSGameState** KSGameState, class AKSPlayerState** KSPlayerState, int* LocalPlayerTeamNum, int* ReportedPlayerTeamNum, EReportPlayerReason* ReportReason, struct FString* InReportComment);
	bool UIX_MutePlayer(class AKSPlayerState** KSPlayerState, bool* Mute);
	void SetHUDVisible(bool* bVisible);
	void ReturnToHome();
	void OnToggleHUD();
	bool IsPlayerMuted(class AKSPlayerState** KSPlayerState);
	void HandleLoginStateChange(EPUMG_LoginState* LoginState);
};


// Class KillstreakUINew.KSGameInfoOverlayBase
// 0x0020 (0x04E8 - 0x04C8)
class UKSGameInfoOverlayBase : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x04C8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSGameInfoOverlayBase");
		return ptr;
	}


	void HandlePlayerStateReady(class AKSPlayerState** PlayerState);
};


// Class KillstreakUINew.KSGamepadPromptWidget
// 0x0010 (0x04D8 - 0x04C8)
class UKSGamepadPromptWidget : public UKSWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x04C8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSGamepadPromptWidget");
		return ptr;
	}


	void SetContext(struct FButtonPromptContext* PromptContext);
	void PushContext(struct FButtonPromptContext* PromptContext);
	bool PopContext(struct FButtonPromptContext* OutContext);
	void ClearAllContext();
	void ApplyContext(struct FButtonPromptContext* Context);
};


// Class KillstreakUINew.KSHealthWidget
// 0x0020 (0x0508 - 0x04E8)
class UKSHealthWidget : public UKSPawnWidget
{
public:
	float                                              CachedHealth;                                             // 0x04E8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedMaxHealth;                                          // 0x04EC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedOverheal;                                           // 0x04F0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x04F4(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSHealthWidget");
		return ptr;
	}


	void OverhealChangeFromChar(class AKSCharacterBase** Character, bool* bAnimatedChange);
	void OnOverhealChanged(float* OldOverheal, float* NewOverheal, bool* bAnimatedChange);
	void OnHealthChanged(float* OldHealth, float* OldMaxHealth, float* NewHealth, float* NewMaxHealth, bool* bAnimatedChange);
	void HealthChangeFromChar(class AKSCharacterBase** Character, bool* bAnimatedChange);
	void HandlePawnOverhealChange(class AKSCharacterBase** Character);
	void HandlePawnHealthChange(class AKSCharacterBase** Character);
};


// Class KillstreakUINew.KSInfoActorWidgetInterface
// 0x0000 (0x0028 - 0x0028)
class UKSInfoActorWidgetInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSInfoActorWidgetInterface");
		return ptr;
	}


	bool SetInfoActor(class AKSWidgetInfoActor** InfoActor);
};


// Class KillstreakUINew.KSInputManager
// 0x0000 (0x00C8 - 0x00C8)
class UKSInputManager : public UPUMG_InputManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSInputManager");
		return ptr;
	}

};


// Class KillstreakUINew.KSJobSelectionWidget
// 0x0000 (0x04C8 - 0x04C8)
class UKSJobSelectionWidget : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSJobSelectionWidget");
		return ptr;
	}


	TArray<class UPUMG_StoreItem*> GetJobStoreItems();
	class UKSStoreItemHelper* GetItemHelper();
};


// Class KillstreakUINew.KSKevinTest
// 0x0000 (0x04C8 - 0x04C8)
class UKSKevinTest : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSKevinTest");
		return ptr;
	}


	int RequestJobItems();
	TArray<class UPUMG_StoreItem*> GetJobStoreItems();
	class UKSStoreItemHelper* GetItemHelper();
};


// Class KillstreakUINew.KSLoadoutDataFactory
// 0x0000 (0x00B0 - 0x00B0)
class UKSLoadoutDataFactory : public UPUMG_LoadoutDataFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSLoadoutDataFactory");
		return ptr;
	}


	bool GetEquippedAccountItem(EPlayerAccountSlot* eSlot, class UKSItem** EquippedItem);
	bool EquipAccountItemToSlot(EPlayerAccountSlot* eSlot, class UKSItem** Item, bool* bSave);
};


// Class KillstreakUINew.KSLobbyHUDNew
// 0x00D0 (0x0658 - 0x0588)
class AKSLobbyHUDNew : public AKSHUDCommon
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0588(0x0018) MISSED OFFSET
	class UKSQueueDataFactory*                         _QueueDataFactory;                                        // 0x05A0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UKSFriendDataFactory*                        _FriendDataFactory;                                       // 0x05A8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UKSEMODataFactory*                           _EMODataFactory;                                          // 0x05B0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UKSPlayerDataFactory*                        _PlayerDataFactory;                                       // 0x05B8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UKSPlayerWhoDataFactory*                     _PlayerWhoDataFactory;                                    // 0x05C0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x05C8(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnTriggerBlockerChange;                                   // 0x05D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               EnablePreMatchAnimation;                                  // 0x05E0(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               EnablePostMatchAnimation;                                 // 0x05E1(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               EnableEOMIdleAnimation;                                   // 0x05E2(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x05E3(0x0001) MISSED OFFSET
	int                                                LastWhatsNewVersion;                                      // 0x05E4(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	struct FScriptMulticastDelegate                    LobbyWidgetReady;                                         // 0x05E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    MainLobbyCameraSet;                                       // 0x05F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    LoginCameraSet;                                           // 0x0608(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BeginPlayingPreMatchAnim;                                 // 0x0618(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    EndPlayingPreMatchAnim;                                   // 0x0628(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    EndPlayingPostMatchAnim;                                  // 0x0638(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	ELobbyCharacterAnimState                           CurrentLobbyCharacterAnimState;                           // 0x0648(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EPUMG_MatchStatus                                  CurrentMatchStatus;                                       // 0x0649(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x064A(0x0006) MISSED OFFSET
	float                                              LoadingScreenFadeInDelay;                                 // 0x0650(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              LoadingScreenFadeInDuration;                              // 0x0654(0x0004) (ZeroConstructor, Config, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSLobbyHUDNew");
		return ptr;
	}


	void UpdateLobbySkinToEquippedSkin();
	bool UIX_MutePlayer(class UPUMG_PlayerInfo** PlayerData, bool* Mute);
	void TransitionCamera(struct FName* CameraTag, float* BlendTime);
	void ToggleDisablePartyLobbyCharacters(bool* Disable);
	void ShowPopupConfirmation(struct FText* Message, ESocialMessageType* MessageType);
	bool ShowAlphaDisclaimerCheckoff();
	bool ShouldShowWhatsNew();
	void SetNewLobbyAnimState(ELobbyCharacterAnimState* TargetState);
	void ResetLobbyCharacters();
	void PlayLoopingLevelSequence(struct FName* LvlSeqTag);
	void OnStoreVendorsLoaded(int* GroupId, TArray<int>* VendorIds);
	bool IsPlayerMuted(class UPUMG_PlayerInfo** PlayerData);
	void HandleSpecificPartyIdDataUpdated(int64_t* PlayerId);
	void HandleSpecificPartyDataUpdated(struct FPUMG_PartyMemberData* PartyMember);
	void HandleReturnFromBattleLevelSeqStopped();
	void HandlePlayerLoadoutsUpdated();
	void HandlePartyMemberDataUpdated(struct FPUMG_PartyMemberData* PartyMember, int* MemberIndex);
	void HandlePartyDataUpdated();
	void HandleMatchStatusUpdated(EPUMG_MatchStatus* MatchStatus);
	void HandleLoginStateChange(EPUMG_LoginState* LoginState);
	void HandleExitToGameLevelSeqStopped();
	void HandleDenyPartyInvitation();
	void HandleAcceptPartyInvitation();
	class UKSPlayerWhoDataFactory* GetPlayerWhoDataFactory();
	class UPUMG_PlayerDataFactory* GetPlayerDataFactory();
	class UKSLobbyWidget* GetLobbyWidget();
	bool GetLobbyCharacterByPosition(ELobbyCharacterIndex* CharacterIndex, class AKSLobbyCharacter** LobbyCharacter);
	class UKSQueueDataFactory* GetKSQueueDataFactory();
	class UKSJsonDataFactory* GetJsonDataFactory();
	class UKSFriendDataFactory* GetFriendDataFactory();
	class UKSEMODataFactory* GetEMODataFactory();
	void ForceEulaAccept();
	void CreateInitialPlayerLoadout();
	void CancelExitToGameLevelAnimStoppedHandling();
};


// Class KillstreakUINew.KSLobbyWidget
// 0x0000 (0x04C8 - 0x04C8)
class UKSLobbyWidget : public UKSWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSLobbyWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSLootSiteIconWidget
// 0x0008 (0x0298 - 0x0290)
class UKSLootSiteIconWidget : public UKSMapIconWidgetBase
{
public:
	class AKSLootSiteBase*                             MarkedLootSite;                                           // 0x0290(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSLootSiteIconWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSLootSiteMarkerWidget
// 0x0020 (0x02B0 - 0x0290)
class UKSLootSiteMarkerWidget : public UKSMapIconWidgetBase
{
public:
	class AKSLootSiteBase*                             MarkedLootSite;                                           // 0x0290(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDisplayDistance;                                       // 0x0298(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bViewedPawnHasEndedFreeFall;                              // 0x029C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x029D(0x0003) MISSED OFFSET
	TArray<ELootSiteRarity>                            TagsToHide;                                               // 0x02A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSLootSiteMarkerWidget");
		return ptr;
	}

};


// Class KillstreakUINew.KSLowAmmoAlertWidget
// 0x0020 (0x05B0 - 0x0590)
class UKSLowAmmoAlertWidget : public UKSActiveWeaponComponentWidget
{
public:
	float                                              LowAmmoThreshold;                                         // 0x0590(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	ELowAmmoState                                      CachedLowAmmoState;                                       // 0x0594(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0595(0x0003) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnAmmoStateChangedDel;                                    // 0x0598(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x8];                                       // 0x05A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class KillstreakUINew.KSLowAmmoAlertWidget");
		return ptr;
	}


	ELowAmmoState GetAmmoState();
	ELowAmmoState CalcAmmoState();
	void AmmoStateChanged();
};


// Class KillstreakUINew.KSMarkerDisplayBase
// 0x0090 (0x0610 - 0x0580)
class UKSMarkerDisplayBase : public UKSMapWidgetBase
{
public:
