#pragma once

// RogueCompany (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// DynamicClass Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C
// 0x3150 (0x4060 - 0x0F10)
class USub_Hero_ABP_Swimming_C : public UKSSwimmingAnimInst
{
public:
	unsigned char                                      UnknownData00[0x180];                                     // 0x0F10(0x0180) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6365BFCC4C7591A5B093198C5CA9FF8D;// 0x1090(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF7D86144FD18CE97CE850A0C3620FD6;// 0x10B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB48BA754A150DD0B68FDEB6143F8C28;// 0x10E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_016F8A42414FA8448FF29887D00489FA;// 0x1108(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C3BF42E04C99D31FBCA4D3AFC7973064;// 0x1130(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8FA2D81C4D2CFD9A1D3672B38E5EBD09;// 0x1158(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96C96496482C0BAF3C57F2ABC50058FF;// 0x1180(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_012AE0B145A05F49154F1E90F995234F;// 0x11A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_131305F54923CBAAD2ECACAF3945B3DC;// 0x11D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47A0474043B940F6201E058474F088B4;// 0x11F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_978582444A90D0658D943AA07765E328;// 0x1220(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC8900DE453DE126083C00B268620A13;// 0x1248(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B29AAAF44C7BC37AE81E2A03FB98EE0;// 0x1270(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5D70A1F49036F86E187EE8C571CB2DC;// 0x1298(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_412E9E2342DC09D338E7689E4AE3F409;// 0x12C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA9EF61A495651544A5BA4AFFA755093;// 0x12E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3E49F7F454B47E501D44EA073EE26EF;// 0x1310(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63F98023469F15F4E5D075806E6B01F3;// 0x1338(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C20C7B848FC539A18F8F09EE074C0C6;// 0x1360(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B9CE16F475FDB9572803197918BAA61;// 0x1388(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EDD270D34439CCC54F7076BF79F86501;// 0x13B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B7BB2FD4D5F14051D3988B2E1051572;// 0x13D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C383F92B49670B60382C5A9FC1940F6D;// 0x1400(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AFB0DB7640628CC60CE90A88F7D7B406;// 0x1428(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48C425984D75FB1F21757BAEDDD2E2B0;// 0x1450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01DF78A64F399D3147CEBFB5A62CE2E1;// 0x1478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE0E9542450071A94C62FDBD42945191;// 0x14A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC8B8B024570B5D19C3E9BABFD02106A;// 0x14C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B8DBD004F9A9F51037D04B9CB4BB5D6;// 0x14F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2D7D736421F594024F7C2AF55FCC2EE;// 0x1518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B223D50A4F3B4C41684F9E8177A8F7A1;// 0x1540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32A8E5E6412D3B7482403D8CC76189E2;// 0x1568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD5472394057FF2F92436AB44DC691B1;// 0x1590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10CC17F94E9FC40609685BA8E8696FD5;// 0x15B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A8F60B345D2BCC08EA3789A0068E76B;// 0x15E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2208B5994E350E2087383187EF43E431;// 0x1608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_938C84254015E9783201E49BF3DF9465;// 0x1630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE2D32B1481E672703161D88E16C4293;// 0x1658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35CE07414E66C5731CDC05BDE1C3FF54;// 0x1680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C49A16B641148CF5EAC0AF962C213E99;// 0x16A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_069CC5CC44770AEB005A73A9D24ABCB8;// 0x16D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD2DED7F48512B4A32546385E8563764;// 0x16F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95C6DD65471AC754B7443CABD78227E5;// 0x1720(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_467FC8FF4F9F95D42A27558422FD5698;// 0x1748(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C515F2564448F49D4D33D1B862F2613F;// 0x1770(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_117CC32948EB9641097EA690D6DD056E;// 0x1850(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_175944A3452D97232ECCB8AB55D462B2;// 0x18F0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DB0862F84FAF81212C4D20A4282CC109;// 0x1968(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B48F3AAA406802512F2B58AB9B138A27;// 0x1988(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1D4E66E44C342597ADEDC6AECFF5A608;// 0x1A00(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_883BE83D461D29C48D82BFA8D3437C61;// 0x1A20(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1CEB25124B78C2379C1AC78AA0FAA6C6;// 0x1A98(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4E5E02644642BDC0B70DEB337C40571;// 0x1B10(0x0078)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1810723A482ED9786D65E3A35FBB2FA5;// 0x1B88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DEAB515D4A5AE66B63C0D5A083B08591;// 0x1C38(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B4C34BB140A857F332326DA5C45C8ED5;// 0x1CB0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_649636EB4BFB62FE322E73B995C528DE;// 0x1D50(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_51D40D87454D2EA7915F3A9E9FA05183;// 0x1DC8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5246D6494533AF804AB652B1A86A34BB;// 0x1DE8(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_DAF14B4B4B8333FABBF358A49999E8D3;// 0x1E60(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_417C216B40B86002A5613DA5D7307CF8;// 0x1F00(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DFA5E3914DE270C28501938B32FB80DE;// 0x1F78(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_72306E2F40562BEF4E561EA320B1161C;// 0x1FF0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CFEE5955472278435E77098893F636ED;// 0x2090(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_603EDB464FFACB0FE0AAAAB73AE14C88;// 0x2108(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_9E589FC04A148FF3686CC28EC92AE41E;// 0x2180(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E51A3454F9D9BEA4EE790B23018C659;// 0x2220(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B3BCBC9148589D60F8DF4ABDE75561E3;// 0x2298(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BBEF757346850EE6272CA6BEF3780FF5;// 0x2338(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_42B7E4A349F6572FE51FD9A0E6870C7C;// 0x23D8(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F61E0BCF4D8673209A1740867FA4D40B;// 0x23F8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_365D3ACF474FA818D36E90890C63965B;// 0x24D8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1EB7458540D92654D747C997DA40A469;// 0x2550(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E1E58DAE4F1D2203D1A1D7B177435752;// 0x25F0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A94E46C45C84CA15BA2C8BD7FCAE960;// 0x2690(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7CAEAE0642DF539AF64C3C9FACC64414;// 0x2708(0x0020)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_D89B8A0E4A46D15874503A9A6BD524AE;// 0x2728(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B751018F4A6AA5651DF05BA3833AD291;// 0x2770(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_833B34C9414AC1C7BCEEA48B1C7196A5;// 0x27B8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA60E27C4777CE00360312BB196C5F23;// 0x2858(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2C181114494B887D79B62E9850F50428;// 0x2878(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71EFBE6E4BA64FF5D15787A6D3A728C7;// 0x2958(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8CA57E6942F03BD9E43D31B818C4FCD8;// 0x2A38(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B6F6A19747B89341DE293880EFF0BC80;// 0x2AD8(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_853E42D84AFC62678C3DDC898DF2A596;// 0x2B78(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CE78DF504D091D4DAB8F838F1F4D58F3;// 0x2C58(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ECF30A674BB4A82A70B05D9AA651E87B;// 0x2C78(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B7BA48B454F182F02CF6C83EC4F57BC;// 0x2CF0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A3142344D9F8147A7982FBD9C16D17F;// 0x2D68(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B99A6784B707571C1DA128478E4B5E2;// 0x2DE0(0x0078)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_609A6014467C39F4F1F58AB8F9462B08;// 0x2E58(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83A52B104D9B553A70390E84D8C10ED7;// 0x2F08(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3BC1D0DB4C1669DF17406A86851C58CE;// 0x2FA8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E26F48494CF96C586AF3DF95E47FE3B8;// 0x3088(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C4FB8F814F606919DFCCC893012E97E5;// 0x3128(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66F899354B6B017FFA04D68F675932AD;// 0x3208(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_181D9160453C281D639385A31321A55F;// 0x3228(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C5DF661A46F3A0BCF91CE5BD153494FC;// 0x3308(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_54B9B58F48FD8F86DB024E871143D5DA;// 0x33A8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EA5412814243D09D8E4BB3A7792BB179;// 0x3488(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D5E4CA2F4C6216821470CB82A0F9AEBF;// 0x3528(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F39FEE6D40EF470112F6C5BFDEB3FEB0;// 0x3608(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_195B649E445A9AE2663FD8A841BD5C77;// 0x3628(0x0078)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_378515F44DFC53AEA8175CB9128D6DB9;// 0x36A0(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0FA0D602416B94D3003F15924BD4FD53;// 0x3708(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FA7A1DDD4EEB856C24ACB59AF3B3C237;// 0x37A8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7832D7494D9F782A930EC2A3C01F1126;// 0x3848(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F62C1F0B4DACD58D5D1773925A2A906A;// 0x3868(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A2D4E9142B1C22C42EB0A924653462E;// 0x3918(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CE6FC1C847C663B969EA9D8320A6A232;// 0x3990(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C7690FD24961DD879C366CB7DCC319D7;// 0x39B0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F224A2D04DF847B204CAC5860BA21674;// 0x3A60(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0763AB0143D1384B6A0FE38FBA876A42;// 0x3B00(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_71F5166D4C72FFF0F3B0B6BF3892C398;// 0x3BA0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0DEF390047AF266A3ECB22A318A31659;// 0x3BC0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1F718FD34D9288412E5611ADB640C271;// 0x3BE0(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A84B1C324736BE5F3C0A6389DA47F1DF;// 0x3CE8(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_Root_46A9D8704CFD3682324A9EBA373F6F28;      // 0x3D88(0x0020)
	float                                              MaxMantleHt;                                              // 0x3DA8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Max2StoryMantleHt;                                        // 0x3DAC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               StringMantlesTogether;                                    // 0x3DB0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x3DB1(0x0007) MISSED OFFSET
	class UAnimSequenceBase*                           Start_Swim_Moving;                                        // 0x3DB8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Start_Swim_Moving_B;                                      // 0x3DC0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Start_Swim_Moving_A;                                      // 0x3DC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Cached_Angle;                                             // 0x3DD0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x3DD4(0x0004) MISSED OFFSET
	class UAnimSequenceBase*                           Stop_Swim_Moving_A;                                       // 0x3DD8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Stop_Swim_Moving_B;                                       // 0x3DE0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           Stop_Swim_Moving;                                         // 0x3DE8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Cached_Stop_Angle;                                        // 0x3DF0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EKSMovementDirection                               locoStartDir;                                             // 0x3DF4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EKSMovementDirection                               locoStopDir;                                              // 0x3DF5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x3DF6(0x0002) MISSED OFFSET
	int                                                TurnVal;                                                  // 0x3DF8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Transition_Submerge;                                      // 0x3DFC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Transition_Surface;                                       // 0x3DFD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Transition_Downed;                                        // 0x3DFE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Transition_Pivot;                                         // 0x3DFF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFallingToWater;                                         // 0x3E00(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x3E01(0x0003) MISSED OFFSET
	struct FVector                                     Replace_with_code;                                        // 0x3E04(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AKSCharacter*                                _Character;                                               // 0x3E10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Transition_State_Lock;                                    // 0x3E18(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Submerge_Directional_Lock;                                // 0x3E19(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x3E1A(0x0002) MISSED OFFSET
	struct FName                                       K2Node_CustomEvent_NotifyName4;                           // 0x3E1C(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                K2Node_CustomEvent_MontageInstanceID4;                    // 0x3E24(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FScriptDelegate                             K2Node_CreateDelegate_OutputDelegate;                     // 0x3E28(0x0010) (ZeroConstructor, Transient, InstancedReference, DuplicateTransient)
	struct FName                                       K2Node_CustomEvent_NotifyName3;                           // 0x3E38(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                K2Node_CustomEvent_MontageInstanceID3;                    // 0x3E40(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FScriptDelegate                             K2Node_CreateDelegate_OutputDelegate1;                    // 0x3E44(0x0010) (ZeroConstructor, Transient, InstancedReference, DuplicateTransient)
	struct FName                                       K2Node_CustomEvent_NotifyName2;                           // 0x3E54(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                K2Node_CustomEvent_MontageInstanceID2;                    // 0x3E5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FScriptDelegate                             K2Node_CreateDelegate_OutputDelegate2;                    // 0x3E60(0x0010) (ZeroConstructor, Transient, InstancedReference, DuplicateTransient)
	struct FName                                       K2Node_CustomEvent_NotifyName1;                           // 0x3E70(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                K2Node_CustomEvent_MontageInstanceID1;                    // 0x3E78(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FScriptDelegate                             K2Node_CreateDelegate_OutputDelegate3;                    // 0x3E7C(0x0010) (ZeroConstructor, Transient, InstancedReference, DuplicateTransient)
	struct FName                                       K2Node_CustomEvent_NotifyName;                            // 0x3E8C(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                K2Node_CustomEvent_MontageInstanceID;                     // 0x3E94(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FScriptDelegate                             K2Node_CreateDelegate_OutputDelegate4;                    // 0x3E98(0x0010) (ZeroConstructor, Transient, InstancedReference, DuplicateTransient)
	int                                                Temp_int_Variable;                                        // 0x3EA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FName                                       Temp_name_Variable;                                       // 0x3EAC(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FScriptDelegate                             K2Node_CreateDelegate_OutputDelegate5;                    // 0x3EB4(0x0010) (ZeroConstructor, Transient, InstancedReference, DuplicateTransient)
	float                                              CallFunc_BreakRotator_Roll;                               // 0x3EC4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch;                              // 0x3EC8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw;                                // 0x3ECC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Variable;                                       // 0x3ED0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Variable1;                                      // 0x3ED1(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Variable2;                                      // 0x3ED2(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x3ED3(0x0001) MISSED OFFSET
	float                                              CallFunc_BreakRotator_Roll1;                              // 0x3ED4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch1;                             // 0x3ED8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw1;                               // 0x3EDC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Variable3;                                      // 0x3EE0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x3EE1(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakRotator_Roll2;                              // 0x3EE4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch2;                             // 0x3EE8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw2;                               // 0x3EEC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll3;                              // 0x3EF0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch3;                             // 0x3EF4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw3;                               // 0x3EF8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll4;                              // 0x3EFC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch4;                             // 0x3F00(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw4;                               // 0x3F04(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select_Default;                                    // 0x3F08(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select1_Default;                                   // 0x3F14(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select2_Default;                                   // 0x3F20(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X;                                   // 0x3F2C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y;                                   // 0x3F30(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z;                                   // 0x3F34(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Select3_Default;                                   // 0x3F38(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll5;                              // 0x3F44(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch5;                             // 0x3F48(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw5;                               // 0x3F4C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X1;                                  // 0x3F50(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y1;                                  // 0x3F54(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z1;                                  // 0x3F58(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X2;                                  // 0x3F5C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y2;                                  // 0x3F60(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z2;                                  // 0x3F64(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              K2Node_Event_DeltaTimeX;                                  // 0x3F68(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Event_StartLocation;                               // 0x3F6C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FVector                                     K2Node_Event_StopLocation;                                // 0x3F78(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	EKSTurnInPlaceAnimationVariant                     K2Node_Event_AnimationVariant;                            // 0x3F84(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x3F85(0x0003) MISSED OFFSET
	float                                              K2Node_Event_DelayTime;                                   // 0x3F88(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_SwitchEnum_CmpSuccess;                             // 0x3F8C(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x3F8D(0x0003) MISSED OFFSET
	class AKSCharacter*                                K2Node_DynamicCast_AsKSCharacter;                         // 0x3F90(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_bSuccess;                              // 0x3F98(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x3F99(0x0003) MISSED OFFSET
	float                                              CallFunc_BreakVector_X3;                                  // 0x3F9C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y3;                                  // 0x3FA0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z3;                                  // 0x3FA4(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	int                                                CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID;// 0x3FA8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x3FAC(0x0004) MISSED OFFSET
	class UPlayMontageCallbackProxy*                   CallFunc_CreateProxyObjectForPlayMontage_ReturnValue;     // 0x3FB0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               CallFunc_IsValid_ReturnValue;                             // 0x3FB8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x3FB9(0x0003) MISSED OFFSET
	struct FVector                                     K2Node_Event_PivotLocation;                               // 0x3FBC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               Temp_bool_Variable4;                                      // 0x3FC8(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x3FC9(0x0003) MISSED OFFSET
	struct FVector                                     K2Node_Select4_Default;                                   // 0x3FCC(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X4;                                  // 0x3FD8(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y4;                                  // 0x3FDC(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z4;                                  // 0x3FE0(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData14[0x4];                                       // 0x3FE4(0x0004) MISSED OFFSET
	class AKSCharacter*                                K2Node_CustomEvent_Character;                             // 0x3FE8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	struct FDamageEffect                               K2Node_CustomEvent_Response;                              // 0x3FF0(0x0048) (Transient, DuplicateTransient)
	bool                                               Temp_bool_Variable5;                                      // 0x4038(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x4039(0x0003) MISSED OFFSET
	struct FVector                                     K2Node_Select5_Default;                                   // 0x403C(0x000C) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_X5;                                  // 0x4048(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Y5;                                  // 0x404C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakVector_Z5;                                  // 0x4050(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_Event_bShouldLock;                                 // 0x4054(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData16[0xB];                                       // 0x4055(0x000B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("DynamicClass Sub_Hero_ABP_Swimming.Sub_Hero_ABP_Swimming_C");
		return ptr;
	}


	void SwimNotifyTransitionStateLock(bool* bpp__bShouldLock__pf);
	void SwimNotifyTransitionEnd();
	void OnNotifyEnd_F44B57B045C18C2DB66787BEEAB72216(struct FName* bpp__NotifyName__pf, int* bpp__MontageInstanceID__pf);
	void OnNotifyBegin_F44B57B045C18C2DB66787BEEAB72216(struct FName* bpp__NotifyName__pf, int* bpp__MontageInstanceID__pf);
	void OnInterrupted_F44B57B045C18C2DB66787BEEAB72216(struct FName* bpp__NotifyName__pf, int* bpp__MontageInstanceID__pf);
	void OnCompleted_F44B57B045C18C2DB66787BEEAB72216(struct FName* bpp__NotifyName__pf, int* bpp__MontageInstanceID__pf);
	void OnBlendOut_F44B57B045C18C2DB66787BEEAB72216(struct FName* bpp__NotifyName__pf, int* bpp__MontageInstanceID__pf);
	void LocomotionStop(struct FVector* bpp__StopLocation__pf);
