#pragma once

// RogueCompany (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// DynamicClass Sub_Hero_ABP_Zipline.Sub_Hero_ABP_Zipline_C
// 0x1D20 (0x2C60 - 0x0F40)
class USub_Hero_ABP_Zipline_C : public UKSZiplineAnimInst
{
public:
	struct FAnimNode_Root                              AnimGraphNode_Root_9FCC757E4FD271BF9AC855B8EE66C0B7;      // 0x0F40(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E1D89A741DF2E43F644BCA5EE070A99;// 0x0F60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50A1C84E4CE59ADEEDDB11A96397537E;// 0x0F88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9C5B0034C9C28AA4A0434BA01E27E73;// 0x0FB0(0x0028)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_577EE3674D6488AD1BA5B5BA5E8F3A50;// 0x0FD8(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_63FADFCC4369E5CA43AEB6BE83BB21A1;// 0x11C8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1C3E2AAE4A4964ADF93621ABE9F633DE;// 0x12A8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_556344E14A3DEE52191486975BC9DB84;// 0x12C8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B9181387485A666970A49889A68ED26F;// 0x1340(0x00A0)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_80F1A71746D41110C5D5FCADC5EDD435;// 0x13E0(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7B2A7F944ED865FD10996EA01BC15667;// 0x15D0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F1E6438D4B172E7906E0079D53B4183A;// 0x16B0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC9C907F4B0002BAFA4830874C43AA4C;// 0x16D0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_004E49B541C4FDCFF0BE1CBF1CBB306F;// 0x1748(0x00A0)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_769354A4460D113A02228D82E3549896;// 0x17E8(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_15CE2B8B48F79EA259D963A5555DBD8A;// 0x19D8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3FB3204C429D3874E9020681EBA45110;// 0x1AB8(0x0020)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_E7FAB0364AE90ECA3A0068A7B0632EAA;// 0x1AD8(0x01F0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4B37677F4A4264EEBDF985ACC9AB792B;// 0x1CC8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3C922D64459392D9F87A8E999F9D887D;// 0x1DA8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B08F0047435927B8D907DC9FA1A9FDFF;// 0x1DC8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E68740ED404712991E413EACABBD2472;// 0x1E78(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C66CEC4848F564C48464C3BAADD88778;// 0x1EF0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_55437C0A4434598990F422921F491EBE;// 0x1F10(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1C80D8C547E02CE76223C19639B9E15C;// 0x1FC0(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EB4B7F74F5444400BF077A179F61B69;// 0x2060(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09A602084B5A102876EB09BB3031974C;// 0x2088(0x0028)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_5D2A1DCD447CE3C46CB9168712D6D42C;// 0x20B0(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A9B9997F4274170024B30AAF76B9B998;// 0x2200(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AED38CD54C92893710188FB6B534F687;// 0x2278(0x0020)
	struct FAnimNode_BlendSpacePlayerSkinned           AnimGraphNode_BlendSpaceSkinned_5F46B98C4B1D30DBFEFD828DAC1F7AFC;// 0x2298(0x01F0)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_BDB7D0FA4F4555D0A7F4998D8304A3AA;// 0x2488(0x0150)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8C8312374A9E45C00FEC4EB5D1DFEC16;// 0x25D8(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_96D929C6478ED6A24CB6B5A994268BD7;// 0x2690(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BB5718EA470B95B8C71CAEAD9061FD51;// 0x2708(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3430879145B3CF253E621D8E69F8854A;// 0x27E8(0x0020)
	struct FAnimNode_SequenceSkinned                   AnimGraphNode_SequenceSkinned_91B03DE44B327E34181677ACAAAFFBFC;// 0x2808(0x0150)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4CAF02B43DC5CECA020BFB40CE483D9;// 0x2958(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0E67BD6A43E8862D4C10108EA3BFC4D5;// 0x29D0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_299786184302FFAB35B4D2B706AC14B4;// 0x29F0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EF067AE54CCF3234E2A3AC8D6046397D;// 0x2AA0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_910E5E2249AF2D083D949AAC6158271D;// 0x2B40(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C980C2A1494DFF75412595B874A259C3;// 0x2BF8(0x0028)
	class AKSCharacter*                                _Character;                                               // 0x2C20(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    Zipline_Lower_Wheel_Rotator;                              // 0x2C28(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    Zipline_Upper_Wheel_Rotator;                              // 0x2C34(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Wheel_Speed;                                              // 0x2C40(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Roll;                               // 0x2C44(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Pitch;                              // 0x2C48(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	float                                              CallFunc_BreakRotator_Yaw;                                // 0x2C4C(0x0004) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class AKSCharacter*                                K2Node_DynamicCast_AsKSCharacter;                         // 0x2C50(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               K2Node_DynamicCast_bSuccess;                              // 0x2C58(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x2C59(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("DynamicClass Sub_Hero_ABP_Zipline.Sub_Hero_ABP_Zipline_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Zipline_AnimGraphNode_TransitionResult_D9C5B0034C9C28AA4A0434BA01E27E73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Zipline_AnimGraphNode_TransitionResult_1E1D89A741DF2E43F644BCA5EE070A99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Zipline_AnimGraphNode_TransitionResult_09A602084B5A102876EB09BB3031974C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Zipline_AnimGraphNode_BlendSpaceSkinned_5F46B98C4B1D30DBFEFD828DAC1F7AFC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_Zipline_AnimGraphNode_BlendSpacePlayer_BB5718EA470B95B8C71CAEAD9061FD51();
	void BlueprintInitializeAnimation();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
