#pragma once

// RogueCompany (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct UISoundLibraries.UISoundLibraries
// 0x0050
struct FUISoundLibraries
{
	class UKSGenericSoundLibrary*                      GenericSounds_2_795651794304368EBEA83C8E2ACCB600;         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSButtonSoundLibrary*                       ButtonSounds_5_49BACD3D4D940EEE5807F29052D7EAE2;          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSButtonSoundLibrary*                       SubMenuButtonSounds_8_3F066A574F186E747FFE12A78A3D9A87;   // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSButtonSoundLibrary*                       LoginButtonSounds_11_D388B67D4F0187964DDB4C937FBE65AF;    // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSButtonSoundLibrary*                       PlayButtonSounds_12_99996B864E555B4D1EC8919F585ECB7F;     // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSScrollButtonSoundLibrary*                 ScrollButtonSounds_15_1577BB0D47E978125A10A99DB440FA8F;   // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSButtonSoundLibrary*                       ShopPurchaseAdvancedButtonSounds_24_EE5946A844E5225325763D8F7B28E9BE;// 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSShopSoundLibrary*                         ShopMenuSounds_21_98203ADF45662A6D8EB980BD5C1D0FC4;       // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSButtonSoundLibrary*                       ShopPurchaseBasicButtonSounds_25_3A1CBD574665EC7131BAA1A848AA178B;// 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UKSToastSoundLibrary*                        SocialToastNotificationSounds_29_338320D24ABF9DF592ED2EB70588CAA1;// 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
