#pragma once

// RogueCompany (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct UIColorPalette.UIColorPalette
// 0x0090
struct FUIColorPalette
{
	struct FLinearColor                                LightGrey_4_913E6B5F4BDCB81BD42D07B27206F261;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                DarkGray_6_8A2E98974234C6FBEA6AB2A063B59778;              // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Red_8_0ED9A2CA4F47AB6D89244F8C0618F009;                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                DarkRed_14_A3C4365940E8C28F156BCA90D52342C2;              // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                White_10_3CB56E054B7D17D8AEED82968E47AE65;                // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                Black_17_EC0FC2FC4B94E66BA1021FA092407FA7;                // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                PlayButtonRed_20_C3A2BF9F48894B46D4E45B8E9BDA3700;        // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                LightRed_23_C3777EA94DE3C020C81F759F8200CE1E;             // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                WarningRed_26_07F976774AC9884BE5DCBCB86A62D5E3;           // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
